import os
import requests
import json
from bs4 import BeautifulSoup
from urllib.parse import urlparse
from PIL import Image
from io import BytesIO

def download_image(url, filename):
    response = requests.get(url)
    if response.status_code == 200:
        image = Image.open(BytesIO(response.content))
        image = image.convert('RGB')  #Convert the image to RGB format
        image_filename = f"{filename}.png"
        image.save(image_filename, format='PNG')
        print(f"Image '{image_filename}' downloaded and saved as PNG successfully.")
    else:
        print(f"Failed to download image from URL: {url}")

def save_product_images(product_data):
    for product in product_data:
        product_name = product['name']
        id = product['id']
        search_query = product_name.replace(" ", "+")
        search_url = f"https://www.google.com/search?q={search_query}&tbm=isch"

        response = requests.get(search_url)
        if response.status_code == 200:
            soup = BeautifulSoup(response.content, 'html.parser')
            image_elements = soup.find_all('img')

            for img in image_elements:
                image_url = img['src']
                if image_url.startswith('http'):
                    parsed_url = urlparse(image_url)
                    image_filename = f"{id}"
                    download_image(image_url, image_filename)
                    break

def main():
    json_data = '''
   [
    {
        "id": "0",
        "name": "Μύλοι Αγίου Γεωργίου Easy Bake Μειγ Muffin 500γρ"
    },
    {
        "id": "1",
        "name": "Kellogg's Coco Pops Chocos 375γρ"
    },
    {
        "id": "2",
        "name": "Soupline Mistral Μαλακτικό Συμπ 28πλ"
    },
    {
        "id": "3",
        "name": "Nestle Nesquik 375γρ"
    },
    {
        "id": "4",
        "name": "Durex Προφυλακτικά Jeans 12τεμ"
    },
    {
        "id": "5",
        "name": "Omo Σκόνη 425γρ"
    },
    {
        "id": "6",
        "name": "Nivea Κρέμα 150ml"
    },
    {
        "id": "7",
        "name": "Γιώτης Κρέμα Παιδική Φαρίν Λακτέ 300γρ"
    },
    {
        "id": "8",
        "name": "Klinex Χλωρίνη Ultra Lemon 1250ml"
    },
    {
        "id": "9",
        "name": "Φάγε Γιαούρτι Αγελαδίτσα 4% 3χ200γρ"
    },
    {
        "id": "10",
        "name": "Μέλισσα Τορτελίνια Γεμ Τυρίων 250γρ"
    },
    {
        "id": "11",
        "name": "Φάγε Total Γιαούρτι 2% 3x200γρ"
    },
    {
        "id": "12",
        "name": "Dirollo Τυρί Cottage 2,2% Λιπ 225γρ"
    },
    {
        "id": "13",
        "name": "Elvive Color Vive Γαλακτ Μαλ 200ml"
    },
    {
        "id": "15",
        "name": "Pampers Prem Care No4 8-14κιλ 34τεμ"
    },
    {
        "id": "16",
        "name": "Brasso Γυαλιστικό Μετάλλων 150ml"
    },
    {
        "id": "17",
        "name": "La Vache Qui Rit Τυροβουτιές 4Χ35γρ"
    },
    {
        "id": "18",
        "name": "Skip Υγρό Πλ Παν/Μικρ 26πλ 910ml"
    },
    {
        "id": "19",
        "name": "Tuboflo Αποφρακτικό Σκόνη Φάκελ 100g"
    },
    {
        "id": "20",
        "name": "Baby Care Μωρόμαντηλα Sensitive 63τεμ"
    },
    {
        "id": "21",
        "name": "Όλυμπος Γιαούρτι Στραγγ 10% Λ 3Χ200γρ"
    },
    {
        "id": "22",
        "name": "Neomat Υγρό Απορρυπαντικό Ρούχων Τριαντάφυλλο 62μεζ"
    },
    {
        "id": "23",
        "name": "Ferrero Kinder Pingui Σοκ/Γκοφρ 4X124γρ"
    },
    {
        "id": "24",
        "name": "Rilken Gel Χτεν Clubber 150ml"
    },
    {
        "id": "25",
        "name": "Johnson's Baby Μπατονέτες Βαμβ 100τεμ"
    },
    {
        "id": "27",
        "name": "Elnett Λακ Βαμμένα Μαλλ Satin 200ml"
    },
    {
        "id": "28",
        "name": "Babylino Sensitive No1 2-5κιλ 28τεμ"
    },
    {
        "id": "29",
        "name": "7 Days Κρουασάν Mini Κακάο 107γρ"
    },
    {
        "id": "30",
        "name": "Purina Gold Gourmet Γατ/Φή Μους Ψάρι 85γρ"
    },
    {
        "id": "31",
        "name": "Knorr Ζωμός Κότας Σπιτικός 112γρ"
    },
    {
        "id": "32",
        "name": "Pummaro Χυμός Τομάτα 500γρ"
    },
    {
        "id": "33",
        "name": "Δέλτα Φυσικ Χυμός Smart Ροδ Βερ200ml"
    },
    {
        "id": "35",
        "name": "Εύρηκα Σκόνη Antikalk 54γρ"
    },
    {
        "id": "36",
        "name": "Dove Σαπούνι 100γρ"
    },
    {
        "id": "37",
        "name": "Υφαντής Ζαμπόν Μπούτι Βραστό Σε Φέτες 160γρ"
    },
    {
        "id": "38",
        "name": "Airwick Αντ/Κο Αποσμ Χώρου Βαν/Ορχιδ"
    },
    {
        "id": "40",
        "name": "Δέλτα Advance Επιδ Μπαν/Μηλο 2Χ150γρ"
    },
    {
        "id": "41",
        "name": "Κατσίκια Νωπά Ελλην Γαλ Τεμ Χ/Κ Χ/Σ  Συσκ/Νο"
    },
    {
        "id": "42",
        "name": "Βεμ Ρώσικη Σαλάτα 250γρ"
    },
    {
        "id": "43",
        "name": "Coca Cola 6Χ330ml"
    },
    {
        "id": "44",
        "name": "Κύκνος Τοματά Τριμμενη 500γρ"
    },
    {
        "id": "45",
        "name": "Κύκνος Τομάτα Ψιλ 400γρ"
    },
    {
        "id": "46",
        "name": "Πορτοκ Μερλίν - Λανε Λειτ- Ναβελ Λειτ Κατ Α Εγχ Ε/Ζ"
    },
    {
        "id": "48",
        "name": "Fissan Baby Ενυδατική κρέμα 150 ml"
    },
    {
        "id": "49",
        "name": "Anatoli Πιπέρι Μαύρο Μύλος 45gr"
    },
    {
        "id": "51",
        "name": "Pedigree Σκυλ/Φή Πατέ Κοτοπ/Μοσχ 300γρ"
    },
    {
        "id": "52",
        "name": "Πορτοκ Βαλέντσια  Κατ Α Εγχ Ε/Ζ"
    },
    {
        "id": "53",
        "name": "Kellogg's Special Κ 375γρ"
    },
    {
        "id": "54",
        "name": "Χρυσή Ζύμη Τυροπιτάκια 1κιλ"
    },
    {
        "id": "56",
        "name": "Lenor Μαλακτικό Gold Orchid 26πλ"
    },
    {
        "id": "57",
        "name": "Fego Καμφορά Πλακέτα 6τεμ"
    },
    {
        "id": "58",
        "name": "Όλυμπος Ταχίνι Χ Γλουτ 300γρ"
    },
    {
        "id": "59",
        "name": "Ballantines Ουίσκι 0,7λιτ"
    },
    {
        "id": "60",
        "name": "Heineken Μπύρα Premium Lager 500ml"
    },
    {
        "id": "61",
        "name": "Knorr Κυβοι Λαχανικών 120γρ"
    },
    {
        "id": "62",
        "name": "Everyday Σερβ/Κια XL All Cotton 24τεμ"
    },
    {
        "id": "63",
        "name": "Pyrox Εντομ/Ko Σπιράλ 20τεμ"
    },
    {
        "id": "64",
        "name": "Τράτα Τόνος Φιλέτο 240γρ"
    },
    {
        "id": "65",
        "name": "Nescafe Cappuccino 10φακ 140γρ"
    },
    {
        "id": "66",
        "name": "Σουρωτή Ανθρακούχο Φυσικό Νερό 250ml"
    },
    {
        "id": "67",
        "name": "Agrino Ρύζι Φανσύ Για Γεμιστά Χ Γλουτ 500γρ"
    },
    {
        "id": "68",
        "name": "Υφαντής Λουκάνικα Βιέννα Αποφλ Χ Γλουτ 250γρ"
    },
    {
        "id": "69",
        "name": "Fissan Baby Σαπούνι 90γρ"
    },
    {
        "id": "70",
        "name": "Γιώτης Αλεύρι Για Όλες Τις Χρήσεις 1κιλ"
    },
    {
        "id": "72",
        "name": "Ferrero Kinder Αυγό Εκπλ Χ Γλουτ 20γρ"
    },
    {
        "id": "73",
        "name": "Μελιτζάνες Φλάσκες Εισ"
    },
    {
        "id": "74",
        "name": "Νίκας Λουκάν Φρανκ Γαλοπ Χ Γλ 280γρ"
    },
    {
        "id": "75",
        "name": "Palette Λακ Πολύ Δυνατή 300ml"
    },
    {
        "id": "76",
        "name": "Knorr Ζωμός Κότας Σε Κόκκους Extra Γεύση 88γρ"
    },
    {
        "id": "77",
        "name": "Nivea Μάσκα Μέλι για Ξηρ/Ευαίσθ Επιδ 2x7,5ml"
    },
    {
        "id": "78",
        "name": "Nivea Αφρόλουτρο Cream Care 750ml"
    },
    {
        "id": "79",
        "name": "Νουνού Γάλα Σκόνη Frisomel 800γρ"
    },
    {
        "id": "80",
        "name": "Tena Lady Maxi 12τεμ"
    },
    {
        "id": "81",
        "name": "Ferrero Kinder Bueno Σοκ/Τα 43γρ"
    },
    {
        "id": "82",
        "name": "Pampers Active Baby No5 11-16κιλ 51τεμ"
    },
    {
        "id": "83",
        "name": "Wella Flex Σπρέυ Ultra Strong 250ml"
    },
    {
        "id": "84",
        "name": "Φάγε Τυρί Τριμμένο Gouda 200γρ"
    },
    {
        "id": "85",
        "name": "Νουνού Κρέμα Γάλακτος Πλήρης 330ml"
    },
    {
        "id": "86",
        "name": "Nescafe Classic Στιγμιαίος Καφές 100γρ"
    },
    {
        "id": "87",
        "name": "Aim Οδ/Μα Παιδ 2/6ετων 50ml"
    },
    {
        "id": "88",
        "name": "Μεβγάλ Harmony 1% Ροδακινο 3Χ200γρ"
    },
    {
        "id": "89",
        "name": "Βιτάμ Μαργαρίνη Soft Light 39% Λιπ 250γρ"
    },
    {
        "id": "90",
        "name": "Sprite Αναψυκτικό 1,5λιτ"
    },
    {
        "id": "92",
        "name": "Amita Motion Φυσικός Χυμός 1λιτ"
    },
    {
        "id": "93",
        "name": "Afroso Wc Block Τριαντ 2Χ40ΓΡ"
    },
    {
        "id": "94",
        "name": "Παυλίδης Μέρεντα Με Φουντούκι 570γρ"
    },
    {
        "id": "95",
        "name": "Tena Lady Extra 20τεμ"
    },
    {
        "id": "96",
        "name": "Barilla Πένες Rigate Νο 73 500γρ"
    },
    {
        "id": "97",
        "name": "Παλίρροια Ντολμαδάκια Γιαλαντζί 280γρ"
    },
    {
        "id": "98",
        "name": "Cif Λεμόνι Creαm 500ml"
    },
    {
        "id": "99",
        "name": "Omo Σκόνη Πλυντ Τροπ Λουλούδια 45πλ"
    },
    {
        "id": "100",
        "name": "Παπαδοπούλου Caprice Ν6 400γρ"
    },
    {
        "id": "101",
        "name": "Sanitas Μεμβράνη Διάφανη 30μετ"
    },
    {
        "id": "102",
        "name": "Alfa Πίτσα Μαργαρίτα Κατεψυγμένη 730γρ"
    },
    {
        "id": "103",
        "name": "Μήλα Στάρκιν Ζαγορ Πηλίου ΠΟΠ Κατ Έξτρα"
    },
    {
        "id": "104",
        "name": "Asti Martini Αφρώδης Οίνος 0,75λιτ"
    },
    {
        "id": "105",
        "name": "Pampers Πάνες Premium Care Nο 3 5-9 κιλ 20τεμ"
    },
    {
        "id": "106",
        "name": "Klinex Σκόνη Πλυντηρίου Ρούχων Original 44μεζ"
    },
    {
        "id": "107",
        "name": "Zewa Χαρτι Κουζίνας Wisch And Weg Economy 3τεμ"
    },
    {
        "id": "108",
        "name": "Maltesers Κουφετάκια Σοκολ 37gr"
    },
    {
        "id": "109",
        "name": "Nescafe Dolce Gusto Cappuccino 16 Καψ"
    },
    {
        "id": "110",
        "name": "OralB Οδ/Μα Pro Exp Prof Prot 75m"
    },
    {
        "id": "112",
        "name": "Life Χυμός Φυσικός Πορτοκάλι 1λιτ"
    },
    {
        "id": "113",
        "name": "Δέλτα Milko Κακάο 450ml"
    },
    {
        "id": "114",
        "name": "Παυλίδης Σοκολάτα Υγείας Αμύγδ 100γρ"
    },
    {
        "id": "115",
        "name": "Nutricia Biskotti Ζωάκια 180γρ"
    },
    {
        "id": "116",
        "name": "Ίον Κακάο 125γρ"
    },
    {
        "id": "117",
        "name": "Noxzema Αφρός Ξυρισ Xtr Sens 300ml"
    },
    {
        "id": "118",
        "name": "Sanitas Αλουμινόχαρτο 10μετ"
    },
    {
        "id": "119",
        "name": "Νουνού Γάλα Ζαχαρούχο 397γρ"
    },
    {
        "id": "120",
        "name": "Pillsbury Σάλτσα Για Πίτσα 200γρ"
    },
    {
        "id": "121",
        "name": "Finish All In 1 Καψ Πλυντ Πιάτ Max Regular 27τεμ"
    },
    {
        "id": "122",
        "name": "7 Days Κρουασάν Κακάο 70γρ"
    },
    {
        "id": "123",
        "name": "3 Άλφα Ρεβύθια Χονδρά Εισαγωγής 500γρ"
    },
    {
        "id": "124",
        "name": "Μαλαματίνα Ρετσίνα 500ml"
    },
    {
        "id": "125",
        "name": "Δέλτα Γάλα Ελαφρύ 1λιτ"
    },
    {
        "id": "126",
        "name": "Αλλατίνη Κέικ Κακάο Με Κομμάτια Σοκολάτας 400γρ"
    },
    {
        "id": "127",
        "name": "Δομοκού Τυρί Κατίκι Ποπ 200g"
    },
    {
        "id": "128",
        "name": "Klinex Χλωρίνη Classic 2λιτ"
    },
    {
        "id": "129",
        "name": "Gouda Τυρί Φάγε Φέτες 200γρ"
    },
    {
        "id": "130",
        "name": "Overlay Ultra Spray Λιποκαθαριστής Λεμόνι 650ml"
    },
    {
        "id": "131",
        "name": "Μπούτι Χοιρινό Α/Ο Νωπό Εισ Χ/Δ "
    },
    {
        "id": "132",
        "name": "Μπριζόλες Καρέ/Κόντρα Χοιρ Νωπές Εισ Μ/Ο "
    },
    {
        "id": "133",
        "name": "Moscato D'Αsti Casarito Κρασί 750ml"
    },
    {
        "id": "134",
        "name": "Μεβγάλ Παραδοσιακό Γιαούρτι Κατσικ 220γρ"
    },
    {
        "id": "135",
        "name": "Jacobs Καφές Φίλτρου Εκλεκτός 500γρ"
    },
    {
        "id": "136",
        "name": "Agrino Φασόλια Μέτρια 500γρ"
    },
    {
        "id": "137",
        "name": "Μελιτζάνες Φλάσκες Εγχ"
    },
    {
        "id": "138",
        "name": "Babylino Πάνες Μωρού Sensitive No 5+ Εως 27 κιλ 16τεμ"
    },
    {
        "id": "139",
        "name": "Bonne Maman Μαρμελάδα Φρα Χ Γλ.370γρ"
    },
    {
        "id": "140",
        "name": "Γιώτης Μαγιά 3φακ 8γρ"
    },
    {
        "id": "141",
        "name": "Pampers Πάνες Μωρού Premium Pants Nο 4 9-15κιλ 38τεμ"
    },
    {
        "id": "142",
        "name": "Μεβγάλ Μανούρι 200γρ"
    },
    {
        "id": "143",
        "name": "Nestle Fitness Bars Σοκολάτα 6Χ23,5γρ"
    },
    {
        "id": "144",
        "name": "Elvive Extraordinary Oil Universal 100ml"
    },
    {
        "id": "145",
        "name": "Παπαδοπούλου Κριτσίνια Σουσάμι 130γρ"
    },
    {
        "id": "146",
        "name": "Snickers Σοκολάτα 50γρ"
    },
    {
        "id": "147",
        "name": "Μεβγάλ Harmony 1% Λεμ 3Χ200γρ"
    },
    {
        "id": "148",
        "name": "Μεβγάλ Ανθότυρο Τυποπ 300γρ"
    },
    {
        "id": "149",
        "name": "Κριθαράκι Μίσκο Χονδρό 500γρ"
    },
    {
        "id": "150",
        "name": "Becel Pro Activ Ρόφημα Με Γαλ 1,8% Λ 1λιτ"
    },
    {
        "id": "151",
        "name": "Heineken Μπύρα 6X330ml"
    },
    {
        "id": "152",
        "name": "Babylino Πάνες Μωρού Sensitive 11 - 25κιλ No 5 18τεμ"
    },
    {
        "id": "153",
        "name": "Tsakiris Πατατάκια Αλάτι 72γρ"
    },
    {
        "id": "154",
        "name": "Agrino Ρύζι Σουπέ Γλασέ 500γρ"
    },
    {
        "id": "155",
        "name": "Agrino Ρύζι Φάνσυ Ελλάδας 1κιλ"
    },
    {
        "id": "156",
        "name": "Λάβδας Καραμέλες Βούτυρου 0% Ζαχαρ 32γρ"
    },
    {
        "id": "157",
        "name": "Παυλίδης Σοκολατα Υγειας Πορτοκ 100γρ"
    },
    {
        "id": "158",
        "name": "Philadelphia Τυρί 300γρ"
    },
    {
        "id": "159",
        "name": "Quaker Νιφ Βρώμης Ολ Άλεσης 500γρ"
    },
    {
        "id": "160",
        "name": "Agrino Φακές Ψιλές Εισαγωγής 500γρ"
    },
    {
        "id": "161",
        "name": "L'Oreal Studio Line Fx Gel Extra Fix 150ml"
    },
    {
        "id": "162",
        "name": "Fa Αφρόλ Yoghurt Van Honey 750m"
    },
    {
        "id": "163",
        "name": "Melissa Σιμιγδάλι Χονδρό 500γρ"
    },
    {
        "id": "164",
        "name": "Everyday Σερβ Norm/Ultra Plus Sens 18τεμ"
    },
    {
        "id": "165",
        "name": "Χρυσά Αυγά Φρέσκα Medium 53/63 γρ.τεμ"
    },
    {
        "id": "166",
        "name": "Bonne Maman Μαρμελάδα Βερικ Χ Γλ 370γρ"
    },
    {
        "id": "167",
        "name": "Εβόλ Γάλα Παστερ Αγελαδ Βιολ 1λιτ"
    },
    {
        "id": "168",
        "name": "7 Days Κέικ Bar Κακάο 5Χ30γρ"
    },
    {
        "id": "169",
        "name": "Dove Αποσμ Σπρέυ 150ml"
    },
    {
        "id": "170",
        "name": "McCain Πατάτες Mediterannean 750γρ"
    },
    {
        "id": "171",
        "name": "Hellmann's Μαγιονέζα 225ml"
    },
    {
        "id": "172",
        "name": "Όλυμπος Γάλα Ζωής Λευκό Υψ Παστ 1,5% Λ 1,5λιτ"
    },
    {
        "id": "173",
        "name": "Τράτα Γαύρος Φιλέτο Κατεψυγμένος 400γρ"
    },
    {
        "id": "175",
        "name": "Larisa Μάσκα χειρουργική 5τεμ 1 χρήση 3ply"
    },
    {
        "id": "176",
        "name": "Καλλιμάνης Καλαμαράκι Κομ Καθαρ 595γρ"
    },
    {
        "id": "177",
        "name": "Γιώτης Κρέμα Ζαχαροπλ Βανίλια 117γρ"
    },
    {
        "id": "178",
        "name": "Quaker Τραγ Μπουκ 4 Ξηροί Καρποί 375γρ"
    },
    {
        "id": "179",
        "name": "Cesar Clasicos Σκυλ/Φή Μοσχ 150γρ"
    },
    {
        "id": "182",
        "name": "Pampers Πάνες Premium Care Νο 2 4-8κιλ 23τεμ"
    },
    {
        "id": "183",
        "name": "Μεβγάλ Ζελέ Φράουλα 3Χ150γρ"
    },
    {
        "id": "184",
        "name": "Ελιά Βόειου Α/Ο Νωπή Ελλ Εκτρ Άνω Των 5 Μην "
    },
    {
        "id": "185",
        "name": "Kerrygold Τυρί Regato Τριμ.400γρ"
    },
    {
        "id": "186",
        "name": "Παπαδοπούλου Πτι Μπερ Ολικ Αλ 225γρ"
    },
    {
        "id": "187",
        "name": "Gordon's Τζιν 0,7λιτ"
    },
    {
        "id": "188",
        "name": "Παπουτσάνη Σαπούνι Πρασ Παραδ 125γρ"
    },
    {
        "id": "190",
        "name": "CIF Spray Κουζίνας 500ml"
    },
    {
        "id": "191",
        "name": "Μπούτι Χοιρινό Α/Ο Νωπό Ελλ Χ/Δ "
    },
    {
        "id": "192",
        "name": "Μεβγάλ Ξινόγαλο 500ml"
    },
    {
        "id": "193",
        "name": "Everyday Σερβ Maxi Nig/Ultra Plus Sens 18τεμ"
    },
    {
        "id": "194",
        "name": "Το Μάννα Παξιμάδια Λαδ Κυθήρων 500γρ"
    },
    {
        "id": "195",
        "name": "Sprite 330ml"
    },
    {
        "id": "196",
        "name": "Pampers Πάνες Μωρού 31τεμ"
    },
    {
        "id": "197",
        "name": "Hellmann's Σαλάτα Φάρμα Κηπ 250γρ"
    },
    {
        "id": "198",
        "name": "Nescafe Azera Καφές Espresso 100% Arabica 100γρ"
    },
    {
        "id": "199",
        "name": "Maggi Noodles Γεύση Κοτόπουλο 60γρ"
    },
    {
        "id": "200",
        "name": "Everyday Σερβ Super/Ultra Plus Sens 10τεμ"
    },
    {
        "id": "201",
        "name": "OralB Χειρ Οδοντoβ 1/2/3 Clas Care 40 Med 2 τεμ"
    },
    {
        "id": "202",
        "name": "Φάγε Γιαούρτι Αγελάδος 2% Λ 3X200γρ"
    },
    {
        "id": "203",
        "name": "Ferrero Kinder Σοκολ 2πλη 16τεμ Χ Γλουτ 200γρ"
    },
    {
        "id": "204",
        "name": "EveryDay Natural Fresh Υγρό Ευαίσθ Περιοχ 200ml"
    },
    {
        "id": "205",
        "name": "Syoss Cond Βαμμένα Μαλ 500ml"
    },
    {
        "id": "206",
        "name": "Babylino Sensitive No6 Econ 15-30κιλ 40τεμ"
    },
    {
        "id": "208",
        "name": "Friskies Γατ/Φή Πατέ Μοσχάρι 400γρ"
    },
    {
        "id": "209",
        "name": "Κρι Κρι Γιαούρτι Στραγγιστό 2% 1κιλ"
    },
    {
        "id": "210",
        "name": "Duck Στερεό Block Aqua Blue 40ml"
    },
    {
        "id": "211",
        "name": "Καλλιμάνης Πέρκα Φιλέτο 595γρ"
    },
    {
        "id": "212",
        "name": "Ζαγόρι Νερό Athletic 750ml"
    },
    {
        "id": "213",
        "name": "Ava Υγρό Πιάτων Ξύδι/Μήλο/Μέντα 430ml"
    },
    {
        "id": "214",
        "name": "Μήλα Στάρκιν Εισ"
    },
    {
        "id": "215",
        "name": "Nestle Fitness Μπαρες Δημητριακών Crunchy Caramel 6X23.5γρ"
    },
    {
        "id": "216",
        "name": "Pedigree Denta Stix Med Σκύλου 180γρ"
    },
    {
        "id": "218",
        "name": "Septona Παιδικό Αφρόλουτρο & Σαμπουάν Αγορια 750ml"
    },
    {
        "id": "219",
        "name": "Μήλα Στάρκιν Κατ Έξτρα Εγχ"
    },
    {
        "id": "220",
        "name": "Κάλας Αλάτι Θαλασσινό Κλασικό 400γρ"
    },
    {
        "id": "221",
        "name": "Aim Οδοντόβ Μέτρια Antiplaque"
    },
    {
        "id": "222",
        "name": "Μεβγάλ Τριμμένο Σκληρό Τυρί 200γρ"
    },
    {
        "id": "223",
        "name": "Καλλιμάνης Γαρίδες Αποφλ Μικρές 425γρ"
    },
    {
        "id": "225",
        "name": "Ροδόπη Γιαούρτι Πρόβειο 240γρ"
    },
    {
        "id": "226",
        "name": "Pummaro Κέτσαπ 500γρ"
    },
    {
        "id": "227",
        "name": "Ελιά Νεαρού Μοσχ Α/Ο Νωπή Εισ"
    },
    {
        "id": "228",
        "name": "Knorr Κύβοι Ζωμού Λαχανικών 12λιτ 24τεμάχια"
    },
    {
        "id": "229",
        "name": "Lux Σαπούνι Soft/Creamy 125γρ"
    },
    {
        "id": "230",
        "name": "Pescanova Μύδια Ψίχα 450γρ"
    },
    {
        "id": "231",
        "name": "Crunch Σοκολάτα Γάλακτος 100γρ"
    },
    {
        "id": "232",
        "name": "Coca Cola 1,5λιτ"
    },
    {
        "id": "233",
        "name": "Palmolive Κρεμ Μέλι Γάλα Αντ/κο 750ml"
    },
    {
        "id": "234",
        "name": "Νουνού Ρόφημα Γάλακτος Calciplus 1λιτ"
    },
    {
        "id": "235",
        "name": "Όλυμπος Γάλα Επιλεγμ 3,7% Λ 1λιτ"
    },
    {
        "id": "236",
        "name": "Καλλιμάνης Γλώσσα Φιλέτο 595γρ"
    },
    {
        "id": "237",
        "name": "Zewa Χαρτί Υγείας Deluxe Χαμομήλι 3 Φύλλα 8τεμ 768γρ"
    },
    {
        "id": "238",
        "name": "Το Μάννα Παξιμάδι Κρίθινο 400γρ"
    },
    {
        "id": "239",
        "name": "Becel Μαργαρίνη Light 40% Λιπ 250γρ"
    },
    {
        "id": "240",
        "name": "Pampers Prem Care No5 11-18κιλ 30τεμ"
    },
    {
        "id": "241",
        "name": "Όλυμπος Γάλα Freelact 1λιτ Χ.Λακτ"
    },
    {
        "id": "242",
        "name": "Jumbo Σνακ Γαριδάρες 85gr"
    },
    {
        "id": "243",
        "name": "Gillette Fusion Proglide 5+1 Ανταλ"
    },
    {
        "id": "244",
        "name": "Αχλάδια Κρυσταλία Εγχ Εξτρα "
    },
    {
        "id": "245",
        "name": "Klinex Καθαριστικό Τουαλέτας Block Ροζ Μανόλια 55γρ"
    },
    {
        "id": "246",
        "name": "Wella Koleston Βαφή Μαλ Ν7/77"
    },
    {
        "id": "247",
        "name": "Κρασί Της Παρέας Ερυθρό 1λιτ"
    },
    {
        "id": "248",
        "name": "La Vache Qui Rit Τυρί Cheddar Φέτες 200γρ"
    },
    {
        "id": "249",
        "name": "Χρυσή Ζύμη Τυροπιτάκια Κουρου 920γρ"
    },
    {
        "id": "250",
        "name": "Χρυσή Ζύμη Λουκανικοπιτάκια Κατεψυγμένα Κουρού 800γρ"
    },
    {
        "id": "251",
        "name": "Μεβγάλ Στραγγιστό Γιαούρτι 3Χ200γρ"
    },
    {
        "id": "252",
        "name": "Καραμολέγκος Ψωμί Τοστ Σταρένιο 680γρ"
    },
    {
        "id": "253",
        "name": "Gillette Venus Close&Clean+2 Ανταλ"
    },
    {
        "id": "254",
        "name": "Ava Υγρό Πιάτων Perle Classic 900ml"
    },
    {
        "id": "255",
        "name": "Dove Deodorant Κρέμα Rollon 50ml"
    },
    {
        "id": "256",
        "name": "Klinex Υγρά Πανάκια 30τεμ"
    },
    {
        "id": "257",
        "name": "Βιτάμ Soft Μαργαρίνη 3/4 250γρ"
    },
    {
        "id": "258",
        "name": "Skip Υγρό Απορρυπαντικό Ρούχων Spring Fresh 42μεζ"
    },
    {
        "id": "259",
        "name": "Ferrero Kinder Delice Κέικ 39γρ"
    },
    {
        "id": "260",
        "name": "Klinex Υγρό Απορρυπαντικό Ρούχων Fresh Clean 40μεζ"
    },
    {
        "id": "261",
        "name": "Noxzema Αποσμ Rollon Classic 50ml"
    },
    {
        "id": "262",
        "name": "Cair Αφρώδης Λευκός Ημίξηρος Οίνος 750ml"
    },
    {
        "id": "263",
        "name": "Τρικαλινό Τυρί Φάγε Ελαφ.Φετ.200γρ"
    },
    {
        "id": "264",
        "name": "Dove Κρεμοσ/νο Ανταλ Regul 500ml"
    },
    {
        "id": "265",
        "name": "Babylino Πάνες Μωρού Sensitive 9-20 κιλ Nο 4+ 19τεμ"
    },
    {
        "id": "266",
        "name": "Friskies Active Σκυλ/Φή Ξηρά Vital 1,5κιλ"
    },
    {
        "id": "268",
        "name": "Halls Καραμ Cool Menthol 28γρ"
    },
    {
        "id": "269",
        "name": "Χρυσά Αυγά Εξαίρετα Φρέσκα Large 6τ Χ 63γρ Πλαστ Θήκη"
    },
    {
        "id": "270",
        "name": "Μύλοι Αγίου Γεωργίου Καλαμποκάλευρο 500γρ"
    },
    {
        "id": "271",
        "name": "Μεβγάλ Ζελέ Κεράσι 3Χ150γρ"
    },
    {
        "id": "272",
        "name": "Φλώρα Αραβοσιτέλαιο 1λιτ"
    },
    {
        "id": "273",
        "name": "Ferrero Kinder Αυγό Εκπλ Χ Γλουτ 3τ 60γρ"
    },
    {
        "id": "275",
        "name": "Gordons Space Τζιν Original 275ml"
    },
    {
        "id": "276",
        "name": "Frulite Φρουτοπoτό Πορτ/Βερικ 500ml"
    },
    {
        "id": "277",
        "name": "Καραμολέγκος Ψωμί Τοστ Σταρένιο Μίνι 340g"
    },
    {
        "id": "278",
        "name": "Pampers Πάνες Βρακάκι Νο 6 15+κιλ 14τεμ"
    },
    {
        "id": "279",
        "name": "Creta Farms Εν Ελλάδι Κεφτεδάκια Κτψ 420γρ"
    },
    {
        "id": "280",
        "name": "Trata Σαρδέλα Λαδιού 100γρ"
    },
    {
        "id": "281",
        "name": "Ferrero Kinder Σοκολ Bars Χ Γλουτ 8τ 100γρ"
    },
    {
        "id": "282",
        "name": "Johnson Baby Βρεφικό Σαμπουάν Αντλιά 300ml"
    },
    {
        "id": "283",
        "name": "Νουνού Κρέμα Γάλακτος Light 200ml"
    },
    {
        "id": "284",
        "name": "Μεβγάλ Κεφίρ Lactose Free Με Ροδακ 500ml"
    },
    {
        "id": "285",
        "name": "Amita Φρουτοποτό Πορ/Μηλ/Βερ 1λιτ"
    },
    {
        "id": "286",
        "name": "Μεβγάλ High Protein Vanilla Drink 242ml"
    },
    {
        "id": "287",
        "name": "Ava Υγρό Πιάτων Perle Χαμομήλι/Λεμόνι 1500ml"
    },
    {
        "id": "288",
        "name": "Fissan Baby Σαπούνι 30% Eνυδ Kρέμα 100gr"
    },
    {
        "id": "289",
        "name": "Μάσκες Προστασ Προσώπου 50τεμ"
    },
    {
        "id": "290",
        "name": "Μίνι Ούζο Γλυκάνισο 200ml"
    },
    {
        "id": "291",
        "name": "Πατάτες  Κύπρου  Κατ Α Συσκ/Νες"
    },
    {
        "id": "292",
        "name": "Μάσκες Προστασ Προσώπου 50τεμ"
    },
    {
        "id": "293",
        "name": "Nestle Nesquik Ρόφημα Σακούλα 400γρ"
    },
    {
        "id": "294",
        "name": "Quanto Μαλακτ Ρουχ Ελλ Νησ 2λιτ"
    },
    {
        "id": "295",
        "name": "Υφαντής Παριζακι Γαλοπούλας 330γρ"
    },
    {
        "id": "296",
        "name": "Softex Χαρτοπετσέτες Λευκές 30x30 56τεμ"
    },
    {
        "id": "297",
        "name": "Camel Υγρο Δερμα Παπουτσιών Μαύρο 75ml"
    },
    {
        "id": "298",
        "name": "Molto Κρουασάν Πραλίνα 80γρ"
    },
    {
        "id": "299",
        "name": "Ajax Υγρό Κατά Των Αλάτων Spray Expert 500ml"
    },
    {
        "id": "300",
        "name": "Άριστον Αλάτι Ιμαλαΐων Φιάλη 400γρ"
    },
    {
        "id": "301",
        "name": "Μεταξά 3 Μπράντυ 700ml"
    },
    {
        "id": "302",
        "name": "Persil Black Essenzia Απορ Υγρ 25πλ 1,5λιτ"
    },
    {
        "id": "303",
        "name": "Oral B Στοματικό Διαλ Δοντ/Ουλων 500ml"
    },
    {
        "id": "304",
        "name": "Μεβγάλ Τριμμένο Σκλήρο Τυρί 80γρ"
    },
    {
        "id": "305",
        "name": "Μεβγάλ Τριμμένο Κεφαλοτύρι 200γρ"
    },
    {
        "id": "306",
        "name": "Γιώτης Κρέμα Ζαχαροπλ Μιλφέιγ 170γρ"
    },
    {
        "id": "307",
        "name": "Πατάτες  Κύπρου  Κατ Α Ε/Ζ"
    },
    {
        "id": "308",
        "name": "Dixan Gel 30πλ"
    },
    {
        "id": "309",
        "name": "Κανάκι Λουκανικοπιτάκια Κατεψυγμένα 920γρ"
    },
    {
        "id": "310",
        "name": "Babylino Πάνες Μωρού Sensitive 3-6κιλ Nο 2 26τεμ"
    },
    {
        "id": "311",
        "name": "Καραμολέγκος Δέκα Αρτοσκεύασμα Σταρένιο Σε Φέτες 550γρ"
    },
    {
        "id": "312",
        "name": "Ζωγράφος Μαρμελ Φράουλ Φρουκτ 415γρ"
    },
    {
        "id": "313",
        "name": "Υφαντής Μπουκιές Κοτόπουλο Κτψ 500γρ"
    },
    {
        "id": "314",
        "name": "Proderm Ενυδατική Κρέμα 150ml"
    },
    {
        "id": "315",
        "name": "Fairy Υγρό Πιάτων Ultra Κανονικό 900ml"
    },
    {
        "id": "316",
        "name": "Elite Φρυγανιά Τρίμμα 180γρ"
    },
    {
        "id": "317",
        "name": "Αγγούρια Εγχ"
    },
    {
        "id": "318",
        "name": "Αρκάδι Υγρό Πλυντ Baby Με Σαπούνι 26πλυς"
    },
    {
        "id": "319",
        "name": "Δέλτα Vitaline 0% Τρ Φρουτ/Δημ 380γρ"
    },
    {
        "id": "320",
        "name": "Silvo Γυαλιστικό Ασημικών 150ml"
    },
    {
        "id": "321",
        "name": "Elite Φρυγανιές Σίκαλης 180γρ"
    },
    {
        "id": "322",
        "name": "Ava Υγρό Πιάτων Perle Σύμπλεγμα Βιταμινών 430ml"
    },
    {
        "id": "323",
        "name": "Elite Φρυγανιές Ολικής Άλεσης 180γρ"
    },
    {
        "id": "324",
        "name": "Swiffer Dusters 5τεμ+Χειρολαβή"
    },
    {
        "id": "325",
        "name": "Dove Αφροντούς Deep Nour 500ml"
    },
    {
        "id": "326",
        "name": "Οίνος Ερ Γλυκ Μαυροδάφνη Αχαΐα 375ml"
    },
    {
        "id": "327",
        "name": "Crunch Σοκολάτα Λευκή 100γρ Χωρίς Γλουτένη"
    },
    {
        "id": "328",
        "name": "Όλυμπος Γιαούρτι Στρ 2% Freelact 2Χ170γρ"
    },
    {
        "id": "329",
        "name": "Γιώτης Τούρτα Μιλφέιγ 532γρ"
    },
    {
        "id": "330",
        "name": "Agrino Ρύζι Bella Parboiled Χ Γλουτ 1κιλ"
    },
    {
        "id": "331",
        "name": "Absolut Βότκα 0,7λιτ"
    },
    {
        "id": "332",
        "name": "Αλλοτινό Οίνος Ερυθρ Ημιγλυκ 0,5ml"
    },
    {
        "id": "333",
        "name": "Kit Kat Σοκολάτα 41,5γρ"
    },
    {
        "id": "334",
        "name": "Bravo Καφές Κλασικός 95γρ"
    },
    {
        "id": "335",
        "name": "Μεταξά 3 Μπράντυ 350ml"
    },
    {
        "id": "336",
        "name": "Alfa Τριγωνάρια Με Τυρί Ανεβατο Κατεψυγμένα 750γρ"
    },
    {
        "id": "337",
        "name": "Χρυσή Ζύμη Μπουγάτσα Θεσσαλονίκης Με Πραλίνα 450γρ"
    },
    {
        "id": "338",
        "name": "Johnson's Baby Κρέμα Μαλλ Χωρ Κομπ 500ml"
    },
    {
        "id": "339",
        "name": "3 Άλφα Φασόλια Γίγαντες Εισαγωγής 500γρ"
    },
    {
        "id": "340",
        "name": "Johnson's Baby Λοσιόν Bedtime 300ml"
    },
    {
        "id": "341",
        "name": "Coca Cola 250ml"
    },
    {
        "id": "343",
        "name": "Χρυσή Ζύμη Σφολιάτα 850γρ"
    },
    {
        "id": "344",
        "name": "Κανάκι Βάση Πίτσας Κατεψυγμένη 660γρ"
    },
    {
        "id": "345",
        "name": "Χρυσή Ζύμη Στριφταρi Τυρί Μυζ Μακεδον 850γρ"
    },
    {
        "id": "346",
        "name": "Klinex Χλωρίνη Classic 1λιτ"
    },
    {
        "id": "347",
        "name": "Ήπειρος Τυρί Ελαφρύ Σε Άλμη 400γρ"
    },
    {
        "id": "348",
        "name": "Akis Καλαμποκάλευρο 500γρ"
    },
    {
        "id": "349",
        "name": "Head & Shoulders Σαμπουάν Total Care 300ml"
    },
    {
        "id": "350",
        "name": "Proderm Σαμπουάν/Αφρόλουτρο 1-3 400ml"
    },
    {
        "id": "351",
        "name": "Activel Plus Αντισηπτικό Gel Χεριών 500ml"
    },
    {
        "id": "352",
        "name": "Γιώτης Φρουτόκρεμα 5 Φρούτα 300γρ"
    },
    {
        "id": "353",
        "name": "Γιώτης Super Mousse Κακ 234γρ"
    },
    {
        "id": "354",
        "name": "Ζαγόρι Φυσικό Μεταλλικό Νερό 1.5λιτ"
    },
    {
        "id": "355",
        "name": "Παπαδοπούλου Φρυγανιές Χωριάτικες Ολικής Άλεσης 240γρ"
    },
    {
        "id": "356",
        "name": "Γιαννιώτη Φύλλο Κρουσ Νωπό 450γρ"
    },
    {
        "id": "357",
        "name": "Ήπειρος Φέτα Μαλακή 400γρ"
    },
    {
        "id": "358",
        "name": "Ροδόπη Γιαούρτι Κατσικίσιο 240γρ"
    },
    {
        "id": "359",
        "name": "Λακωνία Φυσικός Χυμός Πορτοκάλι 1λιτ"
    },
    {
        "id": "360",
        "name": "Ajax Kloron 2σε1 Λεμόνι 1λιτ"
    },
    {
        "id": "361",
        "name": "Κρίς Κρίς Τόστιμο Ψωμί Τόστ Ολικής Άλεσης 400γρ"
    },
    {
        "id": "362",
        "name": "Γλώσσες Φιλέτο Κτψ Εισ Συσκ/Νες"
    },
    {
        "id": "363",
        "name": "Coca Cola Zero 2Χ1,5λιτ"
    },
    {
        "id": "364",
        "name": "Agrino Ρύζι Λαΐς Καρολίνα 500γρ"
    },
    {
        "id": "365",
        "name": "Κατσέλης Κριτσίνια Μακεδονικά 200γρ"
    },
    {
        "id": "366",
        "name": "Όλυμπος Γάλα Επιλεγμ 1,5% Λ 1λιτ"
    },
    {
        "id": "367",
        "name": "Κοντοβερός Σολωμός Φιλέτο Chum 595γρ"
    },
    {
        "id": "368",
        "name": "Όλυμπος Γάλα Βιολ Υψηλ Παστ 3,7% Λ 1λιτ"
    },
    {
        "id": "369",
        "name": "Όλυμπος Φυσ Χυμός Μηλ Πορτ Kaρότο 1λιτ"
    },
    {
        "id": "370",
        "name": "Χρυσά Αυγά Ελληνικά Βιολ 6τ Medium 348γρ"
    },
    {
        "id": "371",
        "name": "Νουνού Κρέμα Γάλακτος Πλήρης 2Χ330ml"
    },
    {
        "id": "372",
        "name": "Vanish Oxi Action Ενισχυτικό Πλεύσης 1γρ"
    },
    {
        "id": "373",
        "name": "Μεβγάλ Στραγγιστό Γιαούρτι 1κιλ"
    },
    {
        "id": "374",
        "name": "Υφαντής Σαλάμι Αέρος Χ Γλουτ 100γρ"
    },
    {
        "id": "375",
        "name": "Fanta Πορτοκαλάδα 1,5λιτ"
    },
    {
        "id": "377",
        "name": "Coca Cola Zero 330ml"
    },
    {
        "id": "378",
        "name": "Υφασμ Μάσκες Παιδικές 2τεμ"
    },
    {
        "id": "379",
        "name": "La Vache Qui Rit Τυρί 8τμχ 140γρ"
    },
    {
        "id": "380",
        "name": "Κοκκινόψαρο  Κτψ Εισ Ε/Ζ"
    },
    {
        "id": "381",
        "name": "Dewar's Ουίσκι 0,7λιτ"
    },
    {
        "id": "382",
        "name": "Barilla Cannelloni 250γρ"
    },
    {
        "id": "383",
        "name": "Pampers Πάνες Μωρού Premium Care Newborn 2-5κιλ 26τεμ"
    },
    {
        "id": "384",
        "name": "Παπαδημητρίου Κρέμα Balsamico Λευκή 250ml"
    },
    {
        "id": "385",
        "name": "Flora Μαργαρίνη Πλακ 70% Λιπ 25% 250γρ"
    },
    {
        "id": "387",
        "name": "Airwick Αποσμ Χώρου Stick Up 120γρ 2τεμ"
    },
    {
        "id": "388",
        "name": "Μινέρβα Χωριό Βούτυρο 41% Επαλ Σκαφ 225γρ"
    },
    {
        "id": "389",
        "name": "Omo Υγρό Απορ Τροπ Λουλ 30πλ 1,95l"
    },
    {
        "id": "390",
        "name": "Μέλισσα Σπαγγέτι Ν6 500γρ"
    },
    {
        "id": "391",
        "name": "Hansaplast Φυσική Ελαφρόπετρα"
    },
    {
        "id": "392",
        "name": "Alfa Φύλλο Χωριάτικο Κιχι Κτψ 750γρ"
    },
    {
        "id": "393",
        "name": "Knorr Κύβοι Ζωμού Λαχανικών Extra Γεύση 147γρ"
    },
    {
        "id": "394",
        "name": "Γιώτης Sanilac 1 Γάλα Σε Σκόνη Πρώτης Βρεφικής Ηλικίας 400γρ"
    },
    {
        "id": "395",
        "name": "Philadelphia Τυρί Light 200γρ"
    },
    {
        "id": "396",
        "name": "Coca Cola Light 330ml"
    },
    {
        "id": "397",
        "name": "Lenor Υγρό Απορρυπαντικό Ρούχων Gold Orchid 19μεζ"
    },
    {
        "id": "398",
        "name": "Φράουλες Εγχ"
    },
    {
        "id": "399",
        "name": "Παυλίδης Γκοφρέτα Υγείας 34γρ"
    },
    {
        "id": "400",
        "name": "Nivea Γαλάκτωμα Καθαρισμού 200ml"
    },
    {
        "id": "401",
        "name": "Κατσίκια Νωπά Ελλην Γαλ Ολοκλ Μ/Κ Μ/Σ"
    },
    {
        "id": "402",
        "name": "Bailey's Irish Cream Λικέρ 700ml"
    },
    {
        "id": "403",
        "name": "Κοτοπουλα Ολοκληρα Νωπα Τ.65% Νιτσιακος Π.Α.Ελλην Συσκ/Να"
    },
    {
        "id": "404",
        "name": "Φάγε Τρικαλινό Τυρί Ζάρι Φάγε 380γρ"
    },
    {
        "id": "405",
        "name": "Omino Bianco Υγρό Blacκ Wash 25πλ 1,5λιτ"
    },
    {
        "id": "406",
        "name": "Skip Duo Καψ Πλυντ Ρούχ Active Clean 578γρ"
    },
    {
        "id": "408",
        "name": "Νουνού Frisogrow Γάλα 800γρ"
    },
    {
        "id": "409",
        "name": "Ajax Καθαριστικό Ultra 7 Φυσ Σαπούνι 1λιτ"
    },
    {
        "id": "410",
        "name": "Palette Βαφή Μαλ Ξανθό N8"
    },
    {
        "id": "411",
        "name": "Άλφα Μπύρα 500ml"
    },
    {
        "id": "412",
        "name": "Γαύρος Νωπός Ελλην Μεσόγ Ολόκλ Ε/Ζ"
    },
    {
        "id": "413",
        "name": "Misko Μακαρόνια Σπαγγέτι Ν3 500γρ"
    },
    {
        "id": "414",
        "name": "Pummaro Χυμός Τομάτα Κλασικός 3Χ250γρ"
    },
    {
        "id": "415",
        "name": "Κοτοπουλα Ολοκληρα Νωπα Τ.65% Πινδος Π.Α.Ελλην Συσκ/Να"
    },
    {
        "id": "416",
        "name": "Στήθος Φιλέτο Κοτ Ελλην. Νωπό Ε/Ζ Χύμα "
    },
    {
        "id": "417",
        "name": "Όλυμπος Γάλα Ζωής Λευκό Ελαφρύ Παστ 1λιτ"
    },
    {
        "id": "419",
        "name": "Ajax Antistatic Καθαριστικό Για Τζάμια Αντλία 750ml"
    },
    {
        "id": "421",
        "name": "Όλυμπος Κεφαλοτύρι Προβ 250γρ"
    },
    {
        "id": "422",
        "name": "Κρεμμύδια Κόκκινα Ξερά Εισ "
    },
    {
        "id": "423",
        "name": "Forno Bonomi Μπισκ Σφολιατ 200γρ"
    },
    {
        "id": "424",
        "name": "Chupa Chups Melody Γλυφιτζ 12γρ"
    },
    {
        "id": "425",
        "name": "Skip Υγρό Regular 30πλ"
    },
    {
        "id": "426",
        "name": "Dixan Σκόνη Πλυντ 42πλ 2,31γρ"
    },
    {
        "id": "427",
        "name": "Philadelphia Τυρί 200γρ"
    },
    {
        "id": "428",
        "name": "Life Φρουτοπ Κρανμπ/Ρασμπ/Μπλουμπ 1lt"
    },
    {
        "id": "429",
        "name": "Creta Farms Εν Ελλάδi Λουκάν Παραδ Χ Γλουτ 340γρ"
    },
    {
        "id": "430",
        "name": "Joya Ρόφημα Σογιας Bio Χ Ζαχ 1λιτ"
    },
    {
        "id": "431",
        "name": "EggPro Ροφ Πρωτεΐνης Φράουλα Χ Γλουτ 250ml"
    },
    {
        "id": "432",
        "name": "Wella New Wave Πηλός Γλυπτικής 75ml"
    },
    {
        "id": "433",
        "name": "Pyrox Εντομ/Κο Σπιράλ 10τεμ"
    },
    {
        "id": "434",
        "name": "Johnnie Walker Ουίσκι Black Label 12ετών"
    },
    {
        "id": "435",
        "name": "Αρνιά Νωπά Ελλην Γαλ Ολοκλ Χ/Κ Χ/Σ "
    },
    {
        "id": "436",
        "name": "O.B. Ταμπόν Original Normal 16τμχ"
    },
    {
        "id": "437",
        "name": "Ace Gentile Ενισχυτικό Πλύσης 2lt"
    },
    {
        "id": "438",
        "name": "Schar Mix B Αλεύρι Για Ψωμί 1κιλ"
    },
    {
        "id": "439",
        "name": "Χρυσή Ζύμη Πίτσα Μαργαρίτα 2X470γρ"
    },
    {
        "id": "440",
        "name": "Texas Νιφάδες Βρώμης 500γρ"
    },
    {
        "id": "441",
        "name": "Όλυμπος Φυσικός Χυμός Πορτοκάλι 1λιτ"
    },
    {
        "id": "442",
        "name": "Alfa Ζύμη Για Πίτσα 600γρ"
    },
    {
        "id": "443",
        "name": "Calgon Αποσκληρυντικό Νερού Πλυντηρίου Ρουχων Gel 1.5λιτ"
    },
    {
        "id": "444",
        "name": "Finish Υγρό Απορρυπαντικό Πλυντηρίου Πιάτων Lemon 1λιτ"
    },
    {
        "id": "446",
        "name": "Klinex Advance Απορρυπαντικό Ρούχων Πλυντηρίου Με Χλώριο 2λιτ"
    },
    {
        "id": "447",
        "name": "Barilla Maccheroncini Μακαρόνια Για Παστίτσιο 500γρ"
    },
    {
        "id": "448",
        "name": "Φάγε Total Γιαούρτι Στραγγιστό 1κιλ"
    },
    {
        "id": "449",
        "name": "Γιώτης Φρουιζελέ Κεράσι Σε Σκ 200γρ"
    },
    {
        "id": "450",
        "name": "Μεβγάλ Κρεμα Σοκολάτα 150γρ"
    },
    {
        "id": "451",
        "name": "Τοματίνια Βελανίδι Ε/Ζ"
    },
    {
        "id": "452",
        "name": "Λαιμός Χοιρινός Μ/Ο Νωπός Εισ"
    },
    {
        "id": "453",
        "name": "Πορτοκ Βαλέντσια Εγ Χυμ Συσκ/Να"
    },
    {
        "id": "454",
        "name": "Δέλτα Γάλα Daily Υψ Παστ Χ Λακτ 1λιτ"
    },
    {
        "id": "455",
        "name": "Flokos Καλαμάρια Φυσ Χυμού 370γρ"
    },
    {
        "id": "456",
        "name": "Lurpak Βούτυρο Ανάλατο 250γρ"
    },
    {
        "id": "458",
        "name": "Παυλίδης Kiss Σοκολάτα Γάλ Φράουλα 27,5γρ"
    },
    {
        "id": "459",
        "name": "Μεβγάλ Τυρί Ημισκλ Μακεδ 420γρ"
    },
    {
        "id": "460",
        "name": "Σπάλα Βόειου Α/Ο Νωπή Ελλ Εκτρ Άνω Των 5 Μην"
    },
    {
        "id": "461",
        "name": "Λεμόνια Εγχ"
    },
    {
        "id": "462",
        "name": "Πατάτες  Ελλ Κατ Α Ε/Ζ"
    },
    {
        "id": "463",
        "name": "Κρεμμύδια Κόκκινα Ξερά Εγχ"
    },
    {
        "id": "464",
        "name": "Persil Express Σκόνη Χεριού 420γρ"
    },
    {
        "id": "465",
        "name": "7 Days Κρουασάν Κακάο 3Χ70γρ"
    },
    {
        "id": "466",
        "name": "Μεβγάλ Only Lact Free 1,5% 1λτ"
    },
    {
        "id": "467",
        "name": "Κολοκυθάκια Εγχ Με Ανθό"
    },
    {
        "id": "468",
        "name": "Φάγε Total Γιαούρτι 5% Φάγε 3Χ200γρ"
    },
    {
        "id": "469",
        "name": "Omo Bianco Υγρό Αφρ Μασ Παραδοσ 30πλ"
    },
    {
        "id": "471",
        "name": "Fornet Καθαρ Φούρνου 300ml"
    },
    {
        "id": "472",
        "name": "Ζαναέ Ντολμαδάκια 280γρ"
    },
    {
        "id": "473",
        "name": "Babylino Sensitive Econ Ν5+ 13-27κιλ 42τεμ"
    },
    {
        "id": "474",
        "name": "Μινέρβα Αραβοσιτέλαιο 2λιτ"
    },
    {
        "id": "476",
        "name": "Μπάρμπα Στάθης Ρύζι Με Καλαμπόκι 600γρ"
    },
    {
        "id": "478",
        "name": "Melissa Σιμιγδάλι Ψιλό 500γρ"
    },
    {
        "id": "479",
        "name": "Adoro Κρέμα Γάλακτος 35% Λιπαρά 200ml"
    },
    {
        "id": "480",
        "name": "Υφαντής Παριζάκι 330γρ"
    },
    {
        "id": "481",
        "name": "Folie Κρουασάν Κρέμα Κακαο 80γρ"
    },
    {
        "id": "482",
        "name": "Γιώτης Sanilac 3 Γάλα Σκόνη 400γρ"
    },
    {
        "id": "483",
        "name": "Life Φρουτοποτό Πορτοκ/Μηλ/Καροτ 1λιτ"
    },
    {
        "id": "484",
        "name": "Nestle Smarties Κουφετάκια Σοκολ 38γρ"
    },
    {
        "id": "485",
        "name": "Amstel Μπύρα 6Χ330ml"
    },
    {
        "id": "486",
        "name": "Everyday Σερβ Maxi Nig/Ultra Plus Sens 10τεμ"
    },
    {
        "id": "487",
        "name": "Zwan Luncheon Meat 200γρ"
    },
    {
        "id": "488",
        "name": "Αρνιά Νωπά Ελλην Γαλ Τεμ Χ/Κ Χ/Σ Συσκ/Νο"
    },
    {
        "id": "489",
        "name": "Softex Χαρτί Υγείας Super Giga 2 Φύλλα 12τεμ"
    },
    {
        "id": "490",
        "name": "Knorr Κύβοι Ζωμού Κότας 6λιτ 12τεμάχια"
    },
    {
        "id": "491",
        "name": "Hellmann's Μουστάρδα Απαλή 500γρ"
    },
    {
        "id": "492",
        "name": "Gillette Αφρός Ξυρ Sens Classic 200ml"
    },
    {
        "id": "494",
        "name": "Μετέωρα Ξύδι Λευκού Κρασιού 400ml"
    },
    {
        "id": "495",
        "name": "Babylino Πάνες Μωρού Sensitive 4 - 9 κιλ No 3 22τεμ"
    },
    {
        "id": "496",
        "name": "Babylino Sensitive No5 Econ 11-25κιλ 44τεμ"
    },
    {
        "id": "497",
        "name": "Friskies Γατ/Φή Πατέ Κοτ/Λαχ 400γρ"
    },
    {
        "id": "498",
        "name": "Coca Cola 330ml"
    },
    {
        "id": "499",
        "name": "Sanitas Σακ Απορ Ultra 52Χ75cm 10τεμ"
    },
    {
        "id": "500",
        "name": "Gillette Venus Ξυρ Γυν Ανταλ 4τεμ"
    },
    {
        "id": "501",
        "name": "Delica Χαρτομάντηλα Αυτοκινήτου Λευκά Big 150τεμ"
    },
    {
        "id": "502",
        "name": "Lipton Τσάι Κίτρινο Φακ 20τεμΧ1,5γρ"
    },
    {
        "id": "503",
        "name": "Regilait Γάλα Αποβ/Νο Σε Σκόνη 250γρ"
    },
    {
        "id": "504",
        "name": "Pedigree Υγ Σκυλ/Φή 3 Ποικ Πουλερικών 400γρ"
    },
    {
        "id": "505",
        "name": "Vanish Oxi Action Ενισχ Πλύσης 500γρ"
    },
    {
        "id": "506",
        "name": "Grants Ουίσκι 0,7λιτ"
    },
    {
        "id": "507",
        "name": "Johnson's Baby Σαμπουάν 750ml"
    },
    {
        "id": "508",
        "name": "Pemα Ψωμί Σικ Ολ Άλεσης 500γρ"
    },
    {
        "id": "509",
        "name": "Agrino Ρύζι Parboiled Bella Χ Γλουτ 500γρ"
    },
    {
        "id": "510",
        "name": "Ruffles Barbeque 130γρ"
    },
    {
        "id": "511",
        "name": "Zewa Χαρτομάντηλα Soft/Strong 90τμχ"
    },
    {
        "id": "512",
        "name": "Λάπα Νεαρού Μοσχ Α/Ο Νωπή Εισ"
    },
    {
        "id": "514",
        "name": "Ariel Alpine Απορ Σκόνη 2,925γρ"
    },
    {
        "id": "515",
        "name": "Dettol Αντιβ/κό Σπρέι 500ml"
    },
    {
        "id": "516",
        "name": "Danone Activia Επιδ Τραγαν Απολ Δημ 200γρ"
    },
    {
        "id": "517",
        "name": "Λουξ Λεμονάδα 330ml"
    },
    {
        "id": "518",
        "name": "Γιώτης Σοκολάτα Sweet/Balance Χ Γλουτ 100γρ"
    },
    {
        "id": "519",
        "name": "3 Άλφα Φασόλια Χονδρά Εισαγωγής 500γρ"
    },
    {
        "id": "520",
        "name": "3 Άλφα Ρύζι Γλασσέ 500γρ"
    },
    {
        "id": "521",
        "name": "Frulite Σαγκουίνι/Μανταρίνι 1λιτ"
    },
    {
        "id": "522",
        "name": "Παπαδημητρίου Κρεμά Βαλσαμ Χ Γλ 250ml"
    },
    {
        "id": "524",
        "name": "Τσίπουρα Υδατ Ελλην Β 200/300 Μεσογ"
    },
    {
        "id": "525",
        "name": "Δέλτα Milko Γάλα Παστερ 250ml"
    },
    {
        "id": "526",
        "name": "Δέλτα Advance Επιδορπιο Λευκό 2χ150γρ"
    },
    {
        "id": "527",
        "name": "Δωδώνη Γιαούρτι Στραγγιστό 8% 1κιλ"
    },
    {
        "id": "528",
        "name": "Μεβγάλ Harmony 1% Ανανάς 3Χ200γρ"
    },
    {
        "id": "529",
        "name": "Έψα Λεμοναδα 232ml"
    },
    {
        "id": "530",
        "name": "Ήλιος Πιπέρι Μαύρο Τριμμένο 40gr"
    },
    {
        "id": "531",
        "name": "Topine Υγρό Επιφ Red Pine 1λιτ"
    },
    {
        "id": "532",
        "name": "Calgon Ταμπλέτες 15τεμ"
    },
    {
        "id": "533",
        "name": "Flora Maργαρίνη Soft 60% Λιπ 225γρ"
    },
    {
        "id": "535",
        "name": "Heineken Μπύρα 330ml"
    },
    {
        "id": "536",
        "name": "Orzene Condit Μπύρας Κανον Μαλλ 250ml"
    },
    {
        "id": "537",
        "name": "Persil Black Υγρό Απορ Πλυντ Ρούχ 12Μεζ 750ml"
    },
    {
        "id": "538",
        "name": "Lux Aφρόλ Magical Beauty 700ml"
    },
    {
        "id": "539",
        "name": "Κρασί Της Παρέας Ροζέ Κοκκινέλι 1λιτ"
    },
    {
        "id": "541",
        "name": "Calgon Αποσκ/Κο Νερού Σκόνη 950γρ"
    },
    {
        "id": "542",
        "name": "Ζωγράφος Φρουκτόζη 400γρ"
    },
    {
        "id": "543",
        "name": "Coca Cola Zero 1λιτ"
    },
    {
        "id": "544",
        "name": "Tsakiris Πατατάκια Αλάτι 120γρ"
    },
    {
        "id": "545",
        "name": "Pescanova Μπακαλιαράκια 600γρ"
    },
    {
        "id": "546",
        "name": "Αρνιά Νωπά Ελλην Γαλ Τεμ Χ/Κ Χ/Σ Ε/Ζ"
    },
    {
        "id": "547",
        "name": "Libresse Σερβ Goodnight Clip 10τεμ"
    },
    {
        "id": "548",
        "name": "Lavazza Καφές Rossa Espresso 250γρ"
    },
    {
        "id": "549",
        "name": "Purina One Γατ/Φή Ξηρά Βοδ/Σιτ 800γρ"
    },
    {
        "id": "550",
        "name": "Always Σερβ Ultra Platinum Night 6τεμ"
    },
    {
        "id": "551",
        "name": "Ντομάτες Εγχ Υδροπ Κατ  Β.  "
    },
    {
        "id": "552",
        "name": "Παυλίδης Μερέντα 360γρ"
    },
    {
        "id": "553",
        "name": "Dettol Κρεμοσάπουνο Soothe 250ml"
    },
    {
        "id": "554",
        "name": "Λεβέτι Κασέρι Ποπ Φέτες 175γρ"
    },
    {
        "id": "555",
        "name": "Gilette Ξυρ Μ/Χ Blue II Slalom 5τεμ"
    },
    {
        "id": "556",
        "name": "Intermed Reval Plus Gel Χεριών Lollipop 75ml"
    },
    {
        "id": "557",
        "name": "Fina Τυρί Φέτες 10% Λιπ 175γρ"
    },
    {
        "id": "558",
        "name": "Νουνού Gouda Φέτες 200γρ"
    },
    {
        "id": "559",
        "name": "Νουνού Γάλα Family 1,5% 1λιτ"
    },
    {
        "id": "561",
        "name": "Πορτοκάλια Βαλέντσια Εισ Ε/Ζ"
    },
    {
        "id": "562",
        "name": "Ρεπάνη Μοσχοφίλερο Λευκός Οίνος 750ml"
    },
    {
        "id": "563",
        "name": "Becel Pro Activ Ελαιόλαδο 35% Λιπ 250γρ"
    },
    {
        "id": "564",
        "name": "Παπαδοπούλου Παξιμαδάκια Σίτου 200γρ"
    },
    {
        "id": "565",
        "name": "Gillette Fusion 5 Proglide Ξυρ Μηχ+Ανταλ"
    },
    {
        "id": "566",
        "name": "Misko Ταλιατέλλες Σιμιγδ 500γρ"
    },
    {
        "id": "567",
        "name": "Pantene Μάσκα Μαλ Αναδόμησης 2λεπτ 300ml"
    },
    {
        "id": "568",
        "name": "Autan Family Care Spray 100ml"
    },
    {
        "id": "569",
        "name": "Εύρηκα Υγρό Απορρυπαντικό Ρούχων Μασσαλίας 30μεζ"
    },
    {
        "id": "570",
        "name": "Αύρα Νερό Μεταλ Μπλουμ 330ml"
    },
    {
        "id": "571",
        "name": "Hellmann's Κέτσαπ 560γρ"
    },
    {
        "id": "572",
        "name": "Ribena Φρουτοποτό Φραγκοστάφυλλο 250ml"
    },
    {
        "id": "573",
        "name": "Ντομάτες Τσαμπί Υδροπ Εγχ  Α"
    },
    {
        "id": "574",
        "name": "Παπαδοπούλου Κριτσίνια Μακεδ Ολ Αλ 200γρ"
    },
    {
        "id": "575",
        "name": "Tsakiris Πατατάκια Ρίγανη 72γρ"
    },
    {
        "id": "576",
        "name": "Svelto Gel Υγρό Πιάτων Με Ξύδι 500ml"
    },
    {
        "id": "577",
        "name": "Lipton Ice Tea Green No Sugar 500ml"
    },
    {
        "id": "578",
        "name": "Leerdammer Τυρί Τοστ Special 125γρ"
    },
    {
        "id": "579",
        "name": "Proderm Ενυδατική Κρέμα Sleep Easy 150ml"
    },
    {
        "id": "580",
        "name": "Gillette Blue Ii Fixed Head 5τεμ"
    },
    {
        "id": "581",
        "name": "Barilla Μακαρόνια Ν5 500γρ"
    },
    {
        "id": "582",
        "name": "Johnson Βρέφικη Πουδρα Σωματος 200γρ"
    },
    {
        "id": "583",
        "name": "Monster Energy Drink 500ml"
    },
    {
        "id": "584",
        "name": "Adoro Βούτυρο 250γρ"
    },
    {
        "id": "585",
        "name": "Νουνού Γάλα Light Μερίδες Διχ 10Χ15γρ"
    },
    {
        "id": "586",
        "name": "Gliss Condition Ultimate Color 200ml"
    },
    {
        "id": "587",
        "name": "McCain Πατάτες Tradition Σακ 1κλ"
    },
    {
        "id": "588",
        "name": "Milner Τυρί Φέτες 175γρ"
    },
    {
        "id": "589",
        "name": "Aim Οδ/τσα 2-6 Παιδική"
    },
    {
        "id": "590",
        "name": "Μακεδονικό Ταχίνι Σε Βάζο 300γρ"
    },
    {
        "id": "592",
        "name": "Λαυράκια Υδατ  Ελλην 400/600 Μεσογ"
    },
    {
        "id": "593",
        "name": "Μεβγάλ Harmony 1% Φράουλα 3Χ200γρ"
    },
    {
        "id": "594",
        "name": "Φάγε Τυρί Flair Cottage 225γρ"
    },
    {
        "id": "595",
        "name": "Τσίπουρα Υδατ Ελλην Α 300/400 Μεσογ"
    },
    {
        "id": "596",
        "name": "Fytro Σόγια Κιμάς 400γρ"
    },
    {
        "id": "597",
        "name": "Κανάκι Σφολιατ Χωρ Στρ Κουρού 450γρ"
    },
    {
        "id": "598",
        "name": "Νουνού Γάλα Εβαπορέ 170γρ"
    },
    {
        "id": "599",
        "name": "Overlay Επίπλων Σπρέυ 250ml"
    },
    {
        "id": "600",
        "name": "Καρπούζια Εγχ"
    },
    {
        "id": "601",
        "name": "Στεργίου Λουκουμάς 4τεμ 340γρ"
    },
    {
        "id": "602",
        "name": "Ροδόπη Αριάνι 1,7% 1λιτ"
    },
    {
        "id": "603",
        "name": "Κολοκυθάκια Εγχ"
    },
    {
        "id": "604",
        "name": "Nesquik Δημητριακά Extra Choco Waves 375γρ"
    },
    {
        "id": "605",
        "name": "Sani Πάνα Ακρατ Sensitive N4 Xlarge 10τεμ"
    },
    {
        "id": "606",
        "name": "Bioten 24η Κρέμα Ενυδ 50ml"
    },
    {
        "id": "607",
        "name": "Quanto Μαλακτ Μη Συμπ Μπλε 2λιτ"
    },
    {
        "id": "608",
        "name": "Λεμόνια Εισ"
    },
    {
        "id": "609",
        "name": "Barilla Λαζάνια Με Αυγά 500γρ"
    },
    {
        "id": "610",
        "name": "Dettol Κρεμοσάπουνο Citrus 250ml"
    },
    {
        "id": "611",
        "name": "Colgate Οδ/τσα Ext Clean Med Twin Pack"
    },
    {
        "id": "612",
        "name": "Τράτα Σαρδέλες Φιλέτο Κατεψυγμένες 400γρ"
    },
    {
        "id": "613",
        "name": "Τεντούρα Κάστρο Λικέρ 500ml"
    },
    {
        "id": "614",
        "name": "Λουξ Πορτοκαλάδα Ανθρ 330ml"
    },
    {
        "id": "615",
        "name": "Pescanova Μπακαλιάρος Ρολό Φιλeto 480γρ"
    },
    {
        "id": "616",
        "name": "Νίκας Γαλοπ Καπνισ + Gouda Τυρί Light Φετ 280γρ"
    },
    {
        "id": "617",
        "name": "Δέλτα Γιαούρτι Μικ Οικ Φαρμ 2% 2Χ200γρ"
    },
    {
        "id": "618",
        "name": "Axe Αφροντούς Africa 400ml"
    },
    {
        "id": "619",
        "name": "Disaronno Λικέρ 700ml"
    },
    {
        "id": "620",
        "name": "Κουρτάκη Ρετσίνα 500ml"
    },
    {
        "id": "621",
        "name": "Viakal Υγρό Καθαρισμού Κατά Των Αλάτων 500ml"
    },
    {
        "id": "622",
        "name": "Λουξ Πορτοκαλάδα Μπλε 330ml"
    },
    {
        "id": "623",
        "name": "Red Bull Ενεργειακό Ποτό 250ml"
    },
    {
        "id": "624",
        "name": "Johnnie Walker Ουίσκι Κόκκινο 0,7λιτ"
    },
    {
        "id": "625",
        "name": "Haig Ουίσκι 0,7λιτ"
    },
    {
        "id": "626",
        "name": "Veet Κρύο Κερι Ταινίες Προσώπου 20τεμ"
    },
    {
        "id": "627",
        "name": "Pedigree Denta Stix Small Σκύλου 110γρ"
    },
    {
        "id": "628",
        "name": "Δέλτα Ρόφημα Advance 80% Λιγ Λακτ 1λιτ"
    },
    {
        "id": "629",
        "name": "Σολομός Νωπός Φέτα Μ/Δ & Μ/Ο Υδ Νορβ/Εισαγ  Β.Α Ατλ Συσκ/Νοσ"
    },
    {
        "id": "630",
        "name": "Μπάρμπα Στάθης Σαλάτα Καλαμπ 450γρ"
    },
    {
        "id": "631",
        "name": "Nestle Cheerios 375γρ"
    },
    {
        "id": "632",
        "name": "Μεβγάλ Γάλα Αγελ Λευκό Πλήρες 3,5% 500ml"
    },
    {
        "id": "633",
        "name": "Κιλότο Νεαρού Μοσχ Α/Ο Νωπό Εισ"
    },
    {
        "id": "634",
        "name": "Ελιά Βόειου Α/Ο Νωπή Εισ"
    },
    {
        "id": "635",
        "name": "Babylino Sensitive No4+ Econ 9-20κιλ 46τεμ"
    },
    {
        "id": "636",
        "name": "Sani Pants N2 Medium 14τεμ"
    },
    {
        "id": "637",
        "name": "Γιώτης Κρέμα Παιδικη Φαρίν Λακτέ Μπισκότο 300γρ"
    },
    {
        "id": "638",
        "name": "Nestle Φαρίν Λακτέ 350γρ"
    },
    {
        "id": "640",
        "name": "Σπάλα Νεαρού Μοσχ Α/Ο Νωπή Εισ"
    },
    {
        "id": "641",
        "name": "Γιώτης Ανθός Ορύζης 150γρ"
    },
    {
        "id": "642",
        "name": "Lurpak Soft Αλατισμένο 225γρ"
    },
    {
        "id": "644",
        "name": "Μεβγάλ Παραδοσιακό Γιαούρτι Αγελαδ 220γρ"
    },
    {
        "id": "645",
        "name": "Barilla Ζυμαρικά Capellini No1 500γρ"
    },
    {
        "id": "646",
        "name": "Καραμολέγκος Παξαμάς Σικαλης 400γρ"
    },
    {
        "id": "647",
        "name": "Misko Παραδ Χυλοπίτες Με Αυγά Μετσόβου 500γρ"
    },
    {
        "id": "648",
        "name": "7 Days Τσουρεκάκι Κλασικό 75γρ"
    },
    {
        "id": "649",
        "name": "Μίνι Babybel Διχτάκι 6τεμ 120γρ"
    },
    {
        "id": "650",
        "name": "Alfa Μπουγάτσα Με Σπανάκι Και Τυρί Κατεψυγμένη 850γρ"
    },
    {
        "id": "651",
        "name": "Εδέμ Φασόλια Κόκκινα Σε Νερό 240γρ."
    },
    {
        "id": "652",
        "name": "Jannis Παστέλι Σουσάμι Χ Γλ 70γρ"
    },
    {
        "id": "653",
        "name": "Τσίπουρα Υδατ Ελλην G 400/600 Μεσογ"
    },
    {
        "id": "654",
        "name": "Ίον Σοκοφρέτα Γάλακτος 38γρ"
    },
    {
        "id": "655",
        "name": "Λουξ Σόδα 330ml"
    },
    {
        "id": "656",
        "name": "Alfa Λουκανικοπιτάκια Κουρού 800gr"
    },
    {
        "id": "657",
        "name": "Μπάρμπα Στάθης Σπανάκι Φύλλα 1κιλ"
    },
    {
        "id": "658",
        "name": "Μινέρβα Ελαιόλαδο 1λιτ"
    },
    {
        "id": "659",
        "name": "Ροδόπη Γάλα Χ Λακτόζη 1λιτ"
    },
    {
        "id": "660",
        "name": "Pillsbury Φυλλο Ζύμης Για Τάρτα 600γρ"
    },
    {
        "id": "661",
        "name": "Syoss Hairspray Max Ultra Strong 400ml"
    },
    {
        "id": "662",
        "name": "Johnson Baby Βρεφικό Σαμπουάν Χαμομήλι 300ml"
    },
    {
        "id": "663",
        "name": "Μύλοι Αγίου Γεωργίου Αλεύρι Για Πίτσα 1κιλ"
    },
    {
        "id": "664",
        "name": "Ω3 Αυγά Αμερικ Γεωργ Σχολής 6τ Large 63-73γρ"
    },
    {
        "id": "665",
        "name": "Agrino Ρύζι Basmati Χ Γλουτ 500γρ"
    },
    {
        "id": "666",
        "name": "Hansaplast Universal Αδιάβροχα 20τεμ"
    },
    {
        "id": "667",
        "name": "Coca Cola Πλαστ 4Χ500ml"
    },
    {
        "id": "668",
        "name": "Danone Activia Επιδ Γιαουρ Τραγ Απόλ 3Χ200γρ"
    },
    {
        "id": "669",
        "name": "Ωμέγα Special Ρύζι Νυχάκι 500γρ"
    },
    {
        "id": "670",
        "name": "Μιμίκος Κοτόπουλο Στηθ Φιλ Νωπό Τυποπ 845γρ"
    },
    {
        "id": "671",
        "name": "Μεβγάλ Topino Απαχο Γάλα Κακάο 450ml"
    },
    {
        "id": "672",
        "name": "Μπανάνες Υπολ Μάρκες "
    },
    {
        "id": "673",
        "name": "Creta Farms Λουκαν Χωριατ Μυρ Χ Γλουτ 400γρ"
    },
    {
        "id": "674",
        "name": "Στήθος Φιλέτο Κοτ Ελλην. Νωπό Συσκ/Νο"
    },
    {
        "id": "675",
        "name": "Garnier Νερό Ντεμακιγιάζ Micellaire 100ml"
    },
    {
        "id": "676",
        "name": "Fairy Υγρό Πιάτων Ultra Λεμόνι 900ml"
    },
    {
        "id": "677",
        "name": "Knorr Ρύζι Risonatto Milanaise 220γρ"
    },
    {
        "id": "678",
        "name": "Knorr Ζωμός Σπιτικός Φρεσκ Λαχανικ 4Χ28γρ"
    },
    {
        "id": "679",
        "name": "Don Simon Kρασί Sangria Χαρτ 1λιτ"
    },
    {
        "id": "680",
        "name": "Tasty Poppers Classic Ποπ Κορν 81γρ"
    },
    {
        "id": "681",
        "name": "Swiffer Dusters Αντ/κα 10τεμ"
    },
    {
        "id": "682",
        "name": "Ρούσσος Νάμα Κρασί Ερυθρό Γλυκο 375ml"
    },
    {
        "id": "683",
        "name": "Skip Σκόνη Spring Fresh 45μεζ"
    },
    {
        "id": "685",
        "name": "Κιλότο Βόειου Α/Ο Νωπό Εισ"
    },
    {
        "id": "686",
        "name": "Coca Cola 2Χ1,5λιτ"
    },
    {
        "id": "687",
        "name": "Knorr Μανιταρόσουπα 90γρ"
    },
    {
        "id": "688",
        "name": "Maggi Πουρές Χ Γλουτ 250γρ"
    },
    {
        "id": "690",
        "name": "Daκor Corned Beef Μοσχάρι 200γρ"
    },
    {
        "id": "691",
        "name": "COVER 10τεμ Μάσκ Με Λάστιχο 1 Χρήση"
    },
    {
        "id": "692",
        "name": "Pedigree Schmackos Μπισκότα Σκύλου 43γρ"
    },
    {
        "id": "693",
        "name": "Γιαννιώτη Φύλλο Χωριατ Νωπό 500γρ"
    },
    {
        "id": "694",
        "name": "Soflan Υγρό Απορ Ρούχ Μαλλ/Ευαισθ 950ml"
    },
    {
        "id": "695",
        "name": "Γιώτης Μπισκοτόκρεμα 300γρ"
    },
    {
        "id": "696",
        "name": "Μίσκο Μακαρόνια Ν6 500γρ"
    },
    {
        "id": "697",
        "name": "Πατάτες  Εισ Κατ Α Ε/Ζ "
    },
    {
        "id": "698",
        "name": "Iglo Κροκέτες Ψαριών Κατεψυγμένες 300γρ"
    },
    {
        "id": "699",
        "name": "Νίκας Σαλάμι Αέρος 72 Πικάντ Χ Γλ 165γρ"
    },
    {
        "id": "700",
        "name": "Σολομός Νωπός Φέτα Μ/Δ & Μ/Ο  Υδ Νορβ/Εισαγ  Β.Α Ατλ Ε/Ζ"
    },
    {
        "id": "701",
        "name": "Μάσκες Προστ Προσώπου 50τεμ Non-Woven"
    },
    {
        "id": "702",
        "name": "Del Monte Κομπόστα Ανανά Φέτες 565γρ"
    },
    {
        "id": "703",
        "name": "Friskies Σκυλ/Φή Βοδ/Κοτ/Λαχ 400γρ"
    },
    {
        "id": "704",
        "name": "Κορπή Φυσικό Μεταλλικό Νερό1,5λιτ"
    },
    {
        "id": "705",
        "name": "Μάκβελ Μακαρόνια Σπαγγέτι Ν6 500γρ"
    },
    {
        "id": "706",
        "name": "Μεβγάλ Τυρί Φέτα Τυπ 200γρ"
    },
    {
        "id": "707",
        "name": "Αχλάδια Κρυσταλία Εισ Εξτρα"
    },
    {
        "id": "708",
        "name": "Fissan Baby Πούδρα 100gr"
    },
    {
        "id": "709",
        "name": "Νεκταρίνια Εγχ"
    },
    {
        "id": "710",
        "name": "Μήλα Φουτζι Εγχ "
    },
    {
        "id": "711",
        "name": "Εβόλ Γιαούρτι Κατσικίσιο Βιολ 190γρ"
    },
    {
        "id": "712",
        "name": "Nutricia Biskotti 180γρ"
    },
    {
        "id": "713",
        "name": "Μπανάνες Dole Εισ"
    },
    {
        "id": "714",
        "name": "Ariel Alpine Υγρές Καψ 3σε1 24πλ"
    },
    {
        "id": "715",
        "name": "Ούζο 12 0,7λιτ"
    },
    {
        "id": "716",
        "name": "Pampers Πάνες Premium Care Nο 4 8-14 κιλ 52τεμ"
    },
    {
        "id": "717",
        "name": "Νίκας Μπέικον Καπνιστό Συσκευασμένο 100γρ"
    },
    {
        "id": "719",
        "name": "Μεβγάλ High Protein Φρα Drink 237ml"
    },
    {
        "id": "720",
        "name": "Klinex Υγρό Καθαρισμού Μπάνιου Spray 750ml"
    },
    {
        "id": "721",
        "name": "Κύκνος Τοματοπολτός 200γρ"
    },
    {
        "id": "722",
        "name": "Μινέρβα Αραβοσιτέλαιο 1λιτ"
    },
    {
        "id": "723",
        "name": "Baby Care Μωρομάντηλα Χαμομήλι Minipack 12τεμ"
    },
    {
        "id": "724",
        "name": "Finish Εκθαμβωτικό Υγρο Πλυν Πιάτ 400ml"
    },
    {
        "id": "725",
        "name": "Εβόλ Γάλα Παστερ Κατσικ Βιολ 590ml"
    },
    {
        "id": "726",
        "name": "3 Αλφα Ρύζι Καρολίνα 500γρ"
    },
    {
        "id": "727",
        "name": "Meritο Spray Σιδερώματος 500ml"
    },
    {
        "id": "728",
        "name": "Καραμολέγκος Ψωμί Τόστ Δέκα Χωριάτικο 500γρ"
    },
    {
        "id": "729",
        "name": "Βιτάμ Μαργαρίνη Soft Σκαφ 500γρ"
    },
    {
        "id": "730",
        "name": "Σολομός Νωπός Φιλετ/νος Με Δέρμα Υδ Νορβ/Εισαγ  Β.Α Ατλ Ε/Ζ"
    },
    {
        "id": "731",
        "name": "Kellogg's Corn Flakes 375γρ"
    },
    {
        "id": "732",
        "name": "Παπαδοπούλου Μπισκότα Πτι Μπερ Ν16 225γ 16τεμ"
    },
    {
        "id": "733",
        "name": "Soupline Mistral Μαλακτικό 13πλ"
    },
    {
        "id": "734",
        "name": "Μπρόκολα Πράσινα Εισ"
    },
    {
        "id": "735",
        "name": "Lay's Πατατάκια Ρίγανη150γρ"
    },
    {
        "id": "736",
        "name": "Παπαδοπούλου Ψωμί Τόστ Plus Σίτου 700γρ"
    },
    {
        "id": "737",
        "name": "Babylino Πάνες Μωρού Sensitive 16+ κιλ No 6 15τεμ"
    },
    {
        "id": "738",
        "name": "Κανάκι Φύλλο Κρούστας 450γρ"
    },
    {
        "id": "739",
        "name": "Μεβγάλ Γάλα «Κάθε Μέρα» 3.5% 1λιτ"
    },
    {
        "id": "740",
        "name": "Ήρα Αλάτι Μαγειρικό 1kg"
    },
    {
        "id": "741",
        "name": "Χρυσή Ζύμη Σπιτικά Τριγων Φέτα Κατικ 750γρ"
    },
    {
        "id": "742",
        "name": "Palmolive Υγρό Πιάτων Λεμόνι 500ml"
    },
    {
        "id": "743",
        "name": "Alfa Κιχι Παραδοσιακή Πίτα Με Τυρί 800γρ"
    },
    {
        "id": "744",
        "name": "Μεβγάλ Κεφίρ Φράουλα 500ml"
    },
    {
        "id": "745",
        "name": "Babylino Sensitive No4 Econ 7-18κιλ 50τεμ"
    },
    {
        "id": "746",
        "name": "Klinex Χλωρίνη Ultra Lemon 750ml"
    },
    {
        "id": "747",
        "name": "Svelto Gel Υγρό Πιάτων Λεμόνι 500ml"
    },
    {
        "id": "748",
        "name": "Friskies Adult Ξηρά Γατ/Φή Κουν/Κοτ/Λαχ 400γρ"
    },
    {
        "id": "749",
        "name": "Glade Αντ/Κο Αποσμ Χώρου Λεβάντα"
    },
    {
        "id": "750",
        "name": "L'Oreal Σαμπ Elvive Color Vive Βαμμένα 400ml"
    },
    {
        "id": "751",
        "name": "Γιώτης Κορν Φλάουρ 200γρ"
    },
    {
        "id": "752",
        "name": "Κανάκι Tυροπιτάκια Κουρού 800γρ"
    },
    {
        "id": "753",
        "name": "Λουμίδης Καφές Ελληνικός 490γρ"
    },
    {
        "id": "755",
        "name": "Everyday Σερβ Extr Long/Ultra Plus Sens 10τεμ"
    },
    {
        "id": "756",
        "name": "Κανάκι Pizza Special 3 Χ 460γρ"
    },
    {
        "id": "757",
        "name": "Everyday Σερβ Super/Ultra Plus Hyp 18 τεμ"
    },
    {
        "id": "758",
        "name": "Coca Cola 500ml"
    },
    {
        "id": "760",
        "name": "Κατσίκια Νωπά Ελλην Γαλ Ολοκλ Χ/Κ Χ/Σ "
    },
    {
        "id": "761",
        "name": "Everyday Σερβ Norm/Ultra Plus Sens 10τεμ"
    },
    {
        "id": "762",
        "name": "Υφαντής Χάμπουργκερ Top Burger 70γρ"
    },
    {
        "id": "763",
        "name": "Μέγα Βαμβάκι 100γρ"
    },
    {
        "id": "764",
        "name": "Twix Σοκολάτα Μπισκότο 50γρ"
    },
    {
        "id": "765",
        "name": "Γιώτης Sanilac 2 Γάλα Σε Σκόνη Δεύτερης Βρεφικής Ηλικίας 400γρ"
    },
    {
        "id": "766",
        "name": "Everyday Σερβ Norm/Ultra Plus Hyp 18τεμ"
    },
    {
        "id": "767",
        "name": "Gillette Blue Ii Plus Slalom Sensit 5τεμ"
    },
    {
        "id": "768",
        "name": "Nivea Κρ Ημέρας Ξηρ/Ευαίσθ Επιδ SPF15 50ml"
    },
    {
        "id": "769",
        "name": "Δέλτα Γάλα Πλήρες 2λιτ"
    },
    {
        "id": "770",
        "name": "Finish Αποσκλ/Κο Αλάτι Πλυν 2,5κιλ"
    },
    {
        "id": "771",
        "name": "Oral B Οδοντικό Νήμα Κηρωμένο 50τεμ"
    },
    {
        "id": "772",
        "name": "Αρνιά Νωπά Ελλην Γαλ Ολοκλ Μ/Κ Μ/Σ "
    },
    {
        "id": "773",
        "name": "Μάσκα Προσ 10τεμ 1 Χρήση"
    },
    {
        "id": "775",
        "name": "Dirollo Τυρί Ημισκλ 14% Λιπ Φετ 175γρ"
    },
    {
        "id": "776",
        "name": "Σαβόϊ Βούτυρο Τύπου Κερκύρας 250gr"
    },
    {
        "id": "777",
        "name": "Φάγε Κεφαλοτύρι Τριμμένο 200γρ"
    },
    {
        "id": "778",
        "name": "Lactacyd Intimate Lotion Ευαίσθ Περιοχ 200ml"
    },
    {
        "id": "779",
        "name": "Green Cola 330ml"
    },
    {
        "id": "781",
        "name": "Nestle Fitness 375γρ"
    },
    {
        "id": "782",
        "name": "Δωδώνη Τυρί Φέτα 400γρ Σε Άλμη"
    },
    {
        "id": "783",
        "name": "Everyday Σερβ Extr Long/Ultra Plus Hyp 10τεμ"
    },
    {
        "id": "784",
        "name": "Canderel Υποκατάστατο Ζάχαρης 120 Δισκία"
    },
    {
        "id": "785",
        "name": "Calgon Gel 750ml"
    },
    {
        "id": "786",
        "name": "Nestle Fitness Dark Chocolate 375γρ"
    },
    {
        "id": "787",
        "name": "Rio Mare Τόνος Νερόυ 2Χ160γρ"
    },
    {
        "id": "788",
        "name": "Όλυμπος Φυσικός Χυμός Πορτοκάλι 1,5λιτ"
    },
    {
        "id": "789",
        "name": "Johnson's Baby Oil Ενυδατικό Λάδι, 300ml"
    },
    {
        "id": "791",
        "name": "Vanish Σαμπουάν Χαλιών 500ml"
    },
    {
        "id": "792",
        "name": "Soupline Mistral Μαλακτικό Συμπ 82πλ"
    },
    {
        "id": "793",
        "name": "Heineken Μπύρα 4X500ml"
    },
    {
        "id": "794",
        "name": "Tuborg Club Σόδα 500ml"
    },
    {
        "id": "795",
        "name": "Axe Αποσμητικό Σπρέυ Africa 150ml"
    },
    {
        "id": "796",
        "name": "Μάσκα προσώπου 10τεμ 1 χρήση"
    },
    {
        "id": "797",
        "name": "Nestle Cookie Crispies 375γρ"
    },
    {
        "id": "798",
        "name": "Scotch Brite Σύρμα Πράσινο Κουζίνας"
    },
    {
        "id": "799",
        "name": "Derby Ίον 38γρ"
    },
    {
        "id": "800",
        "name": "Lurpak Βούτυρο Αναλ Αλουμ 125γρ"
    },
    {
        "id": "801",
        "name": "Barilla Μακαρ Linguine Bavette Ν13 500γρ"
    },
    {
        "id": "802",
        "name": "Μεβγάλ Ζελέ Ροδάκινο 3Χ150γρ"
    },
    {
        "id": "803",
        "name": "Libresse Σερβιέτες Invisible Normal 10τεμ"
    },
    {
        "id": "804",
        "name": "Ajax Uλιτra Υγρό Γενικού Καθαρισμού Λεμόνι 1λιτ"
    },
    {
        "id": "805",
        "name": "Mini Babybel Τυρί Classic 10τεμ 200γρ"
    },
    {
        "id": "806",
        "name": "Κανάκι Ζύμη Κατεψυγμένη Κουρού 700γρ"
    },
    {
        "id": "807",
        "name": "Stella Artois Μπύρα 330ml"
    },
    {
        "id": "808",
        "name": "Airwick Αντ/Κο Freshmatic Βαν/Ορχιδ 250ml"
    },
    {
        "id": "809",
        "name": "Lacta Σοκολάτα Γάλακτος 200γρ"
    },
    {
        "id": "810",
        "name": "Neomat Total Eco Απορ Σκον 14πλ 700γρ"
    },
    {
        "id": "811",
        "name": "Nivea Κρ Νύχτας Cellular Anti-Age 50ml"
    },
    {
        "id": "812",
        "name": "Nestle Ρόφημα Γαλακτ Junior 2+ Rtd 1λιτ"
    },
    {
        "id": "813",
        "name": "Μίσκο Κριθαράκι Μέτριο 500γρ"
    },
    {
        "id": "814",
        "name": "Κύκνος Κέτσαπ Top Down Χ Γλουτ 580γρ"
    },
    {
        "id": "815",
        "name": "Amstel Μπύρα 4X500ml"
    },
    {
        "id": "816",
        "name": "Babylino Sensitive No3 Econ 4-9κιλ 56τεμ"
    },
    {
        "id": "817",
        "name": "Dettol Spray Γενικού Καθαρισμού Υγιεινή Και Ασφάλεια Λεμόνι Μέντα 500ml"
    },
    {
        "id": "818",
        "name": "Μάννα Παξιμάδια Κριθαρένιο 800γρ"
    },
    {
        "id": "819",
        "name": "Μεβγάλ Creme Καραμελέ 150γρ"
    },
    {
        "id": "820",
        "name": "Τσιλιλή Τσίπουρο Χ Γλυκάνισο 200ml"
    },
    {
        "id": "821",
        "name": "Μεβγάλ Τριμμενη Μυζήθρα Ξηρή 200γρ"
    },
    {
        "id": "822",
        "name": "Fairy Υγρό Απορρυπαντικό Πιάτων Power Spray 375ml"
    },
    {
        "id": "823",
        "name": "Biofarma Παστέλι Βιολ Με Σουσάμι 30gr"
    },
    {
        "id": "825",
        "name": "Γιώτης Mείγμα Παγωτού Καιμάκι 508γρ"
    },
    {
        "id": "826",
        "name": "Johnson Baby Βρεφικό Αφρόλουτρο Bedtime 500ml"
    },
    {
        "id": "827",
        "name": "Στεργίου Κέικ Ανάμεικτο 80γρ"
    },
    {
        "id": "828",
        "name": "Aim Οδ/μα White System 75ml"
    },
    {
        "id": "829",
        "name": "Everyday Σερβ Maxi Nig/Ultra Plus Hyp 18τεμ"
    },
    {
        "id": "830",
        "name": "Κρι Κρι Γιαούρτι Στραγγιστό 10% 1κιλ"
    },
    {
        "id": "831",
        "name": "Δέλτα Mmmilk Γάλα Οικογεν Χαρτ 1,5% 1,5λιτ"
    },
    {
        "id": "832",
        "name": "Pillsbury Ζύμη Κρουασάν 230γρ"
    },
    {
        "id": "833",
        "name": "Μάσκα Προσώπου Υφασμ 1τεμ"
    },
    {
        "id": "834",
        "name": "St Clemens Μπλέ Τυρί Δανίας 100γρ"
    },
    {
        "id": "835",
        "name": "Υφαντής Γαλοπούλα Καπνιστή 160γρ"
    },
    {
        "id": "836",
        "name": "Μπριζόλες Καρέ/Κόντρα Χοιρ Νωπές Ελλ Μ/Ο "
    },
    {
        "id": "838",
        "name": "Zewa Χαρτί Κουζίνας Με Σχέδια 2τεμ"
    },
    {
        "id": "839",
        "name": "Jose Cuervo Τεκίλα Espec Κιτρ 0,7λιτ"
    },
    {
        "id": "840",
        "name": "Ίον Σοκολ Αμυγδ Υγείας 100γρ"
    },
    {
        "id": "841",
        "name": "Friskies Άμμος Υγιεινής 5κιλ"
    },
    {
        "id": "842",
        "name": "Gillette Sensor Excel Ανταλ Ξυρ 5 τεμ"
    },
    {
        "id": "843",
        "name": "Fairy Υγρό Πιάτων Ultra Classic 400ml"
    },
    {
        "id": "845",
        "name": "Scotch Brite Σφουγγαράκι Πράσ Κλασ 1τεμ"
    },
    {
        "id": "846",
        "name": "Palmolive Αφρόλ Natural Αμυγδ 650ml"
    },
    {
        "id": "847",
        "name": "Pedigree Σκυλ/Φή Μοσχάρι 400γρ"
    },
    {
        "id": "848",
        "name": "Βίκος Φυσικό Μεταλλικό Νερό 500ml"
    },
    {
        "id": "849",
        "name": "Uncle Bens Ρύζι Basmati 500γρ"
    },
    {
        "id": "850",
        "name": "Εύρηκα Λευκαντικό 60γρ"
    },
    {
        "id": "851",
        "name": "Μάσκες Προστ Προσώπου 50τεμ"
    },
    {
        "id": "852",
        "name": "Libero Swimpants Πάνες Small 7-12κιλ 6τεμ"
    },
    {
        "id": "853",
        "name": "Εβόλ Γάλα Παστερ Διαλεχτο 3,7% Λ 1λιτ"
    },
    {
        "id": "854",
        "name": "Dr Beckmann Καθαριστικο Φουρνου 375ml"
    },
    {
        "id": "855",
        "name": "Lipton Ice Tea Instant Λεμονι 125γρ"
    },
    {
        "id": "856",
        "name": "Klinex Καθ Πατώματος Λεμόνι 1λιτ"
    },
    {
        "id": "857",
        "name": "Ντομάτες Εγχ Υδροπ Α "
    },
    {
        "id": "858",
        "name": "Jacobs Καφές Φίλτρου Εκλεκτός 250γρ"
    },
    {
        "id": "859",
        "name": "Ντομάτες Εγχ Υπαιθρ Τσαμπί "
    },
    {
        "id": "860",
        "name": "Γιώτης Σιρόπι Σοκολάτα 350γρ"
    },
    {
        "id": "861",
        "name": "Klinex Χλωρίνη Lemon 2λιτ"
    },
    {
        "id": "862",
        "name": "Sani Υποσέντονα Fresh Maxi Plus 15τεμ"
    },
    {
        "id": "863",
        "name": "Coca Cola 1λιτ"
    },
    {
        "id": "864",
        "name": "Αγγουράκια Κιλ Τυπ Νειλ – Τυπ Κνωσ"
    },
    {
        "id": "865",
        "name": "Pom Pon Eyes & Face Μαντηλάκια 20τεμ"
    },
    {
        "id": "866",
        "name": "Κρασί Της Παρέας Λευκό 1λιτ"
    },
    {
        "id": "867",
        "name": "Veet Αποτριχωτική Κρέμα Κανον Επιδερμ 100ml"
    },
    {
        "id": "868",
        "name": "Γιώτης Κουβερτούρα Γαλακ Σταγ 100γρ"
    },
    {
        "id": "869",
        "name": "Ίον Σοκολάτες Γάλακτος 70γρ"
    },
    {
        "id": "870",
        "name": "Ίον Σοκοφρέτα Σοκολ Υγείας 38γρ"
    },
    {
        "id": "871",
        "name": "Αρκάδι Σαπούνι Πλάκα Πρασ 4Χ150γρ"
    },
    {
        "id": "872",
        "name": "Fissan Baby Κρέμα 50γρ"
    },
    {
        "id": "873",
        "name": "Neomat Σκόνη Πλυντηρίου Ρούχων Άγριο Τριαντάφυλλο 45μεζ"
    },
    {
        "id": "874",
        "name": "Dove Ντούς Deeply Nourisηing 750ml"
    },
    {
        "id": "875",
        "name": "Nivea Νερό Διφασ Ντεμακ Ματιών 125ml"
    },
    {
        "id": "876",
        "name": "Άλτις Κλασσικό Ελαιόλαδο 2λιτ"
    },
    {
        "id": "877",
        "name": "Μπανάνες Chiquita Εισ"
    },
    {
        "id": "878",
        "name": "Martini Bianco Απεριτίφ 1λιτ"
    },
    {
        "id": "880",
        "name": "Veet Κρέμα Για Ευαίσθ Επιδ 100ml"
    },
    {
        "id": "881",
        "name": "Γιώτης Φρουιζελέ Φράουλα 2X100γρ"
    },
    {
        "id": "882",
        "name": "Barilla Σάλτσα Pesto Alla Genovese 190γρ"
    },
    {
        "id": "885",
        "name": "Hellmann's Μαγιονέζα 450ml"
    },
    {
        "id": "886",
        "name": "Dorodo Τυρί Τριμμ Φακ 80γρ"
    },
    {
        "id": "887",
        "name": "Uncle Bens Ρύζι 10 λεπτά 4Χ125γρ"
    },
    {
        "id": "888",
        "name": "Fix Hellas Μπύρα 6X330ml"
    },
    {
        "id": "889",
        "name": "Kleenex Χαρτί Υγείας 2 Φύλλα 12τεμ"
    },
    {
        "id": "890",
        "name": "Hellmann's Μουστάρδα Απαλή 250γρ"
    },
    {
        "id": "891",
        "name": "Dettol Υγρό Καθαριστικό Αντιβακτηριδιακό Κουζινας 500ml Με Ενεργο Οξυγονο Power & Pure"
    },
    {
        "id": "892",
        "name": "Βλάχα Χυλοπιτάκι Με Αυγά 500γρ"
    },
    {
        "id": "893",
        "name": "Νουνού Γάλα Εβαπορέ 400γρ"
    },
    {
        "id": "894",
        "name": "Κύκνος Τοματοπολτός 28% Μεταλ 70γρ"
    },
    {
        "id": "895",
        "name": "Nivea Baby Φυσιολογικός Ορός 24Χ5ml"
    },
    {
        "id": "896",
        "name": "Dr Beckmann Καθαρ Πλυν Ρούχ 250γρ"
    },
    {
        "id": "897",
        "name": "Gillette Gel Ξυρ Μοιsture 200ml"
    },
    {
        "id": "898",
        "name": "Σαρδέλλες Νωπές Ελλην Μεσογ Ε/Ζ"
    },
    {
        "id": "899",
        "name": "Λουμίδης Καφές Ελληνικός 96γρ"
    },
    {
        "id": "900",
        "name": "Vapona Σκοροκτόνα Φύλλα 20τμχ"
    },
    {
        "id": "901",
        "name": "Rio Mare Τόνος Λαδιού 2Χ160γρ"
    },
    {
        "id": "902",
        "name": "Sani Lady Sensitive Super N5 10τεμ"
    },
    {
        "id": "903",
        "name": "Klinex Σπρέυ 4σε1 750ml"
    },
    {
        "id": "905",
        "name": "Όλυμπος Γιαούρτι Στραγγιστό 10% 1κιλ"
    },
    {
        "id": "906",
        "name": "Όλυμπος Γιαούρτι Στραγγιστό 2% 3Χ200γρ"
    },
    {
        "id": "907",
        "name": "Κοτοπουλα Ολοκληρα Νωπα Χυμα Τ.65% Π.Α.Ελλην"
    },
    {
        "id": "908",
        "name": "Ίον Σοκοφρέτα Μίνι Σακουλάκι 210γρ"
    },
    {
        "id": "909",
        "name": "Ultrex Σαμπουάν Γυναικ Κανον 360ml"
    },
    {
        "id": "910",
        "name": "Κύκνος Τοματοπολτός 410γρ"
    },
    {
        "id": "913",
        "name": "Μπρόκολα Πράσινα Εγχ"
    },
    {
        "id": "914",
        "name": "Παπαδοπούλου Μπισκότα Μιράντα Ν16 250γρ 12τεμ"
    },
    {
        "id": "915",
        "name": "Misko Τορτελίνι Με Τυρί 500γρ"
    },
    {
        "id": "916",
        "name": "Βλάχας Γάλα Εβαπορέ Ελαφρύ 410γρ"
    },
    {
        "id": "917",
        "name": "Δέλτα Smart Επιδ Γιαουρ Φραουλ 2Χ145γρ +1δώρο"
    },
    {
        "id": "918",
        "name": "Champion Κρουασ Πραλίνα Φουντουκ 4X70γρ"
    },
    {
        "id": "919",
        "name": "Γαύρος Νωπός Καθαρ Απεντ/νος Ελλην Μεσογ Συσ/Νος"
    },
    {
        "id": "920",
        "name": "Φάγε Total Γιαούρτι Στραγγιστό 500γρ"
    },
    {
        "id": "921",
        "name": "Μεβγάλ Παραδοσιακό Γιαούρτι Προβ 220γρ"
    },
    {
        "id": "922",
        "name": "Χρυσή Ζύμη Μπουγάτσα Θεσ/Κης Κρέμα 850γρ"
    },
    {
        "id": "923",
        "name": "Μέλισσα Κριθαράκι Μέτριο 500γρ"
    },
    {
        "id": "924",
        "name": "Flokos Σκουμπρί Φιλέτο Καπνιστό 160gr"
    },
    {
        "id": "925",
        "name": "Λακώνια Χυμός Νέκταρ Πορ/Μηλ/Βερ 250ml"
    },
    {
        "id": "926",
        "name": "Septona Παιδικό Σαμπουάν Κορίτσια 500ml"
    },
    {
        "id": "927",
        "name": "Μεβγάλ Κεφίρ 500ml"
    },
    {
        "id": "928",
        "name": "Donna Οινόπνευμα Καθαρό 245ml"
    },
    {
        "id": "929",
        "name": "Γιώτης Αλεύρι Φαρίνα Κόκκινη 500γρ"
    },
    {
        "id": "930",
        "name": "Ace Gentile Ενισχυτικό Πλύσης 1lt"
    },
    {
        "id": "932",
        "name": "Bref Power Active Wc Block Ωκεαν 50γρ"
    },
    {
        "id": "933",
        "name": "Knorr Ζωμός Κότας 12 κυβ 120γρ"
    },
    {
        "id": "934",
        "name": "Colgate Οδ/Μα Sensation Whiten.75ml"
    },
    {
        "id": "935",
        "name": "Almiron-1 Γάλα Σε Σκόνη Πρώτης Βρεφικής Ηλικίας 800γρ"
    },
    {
        "id": "936",
        "name": "Dettol All In 1 Πράσινο Μήλο 500ml"
    },
    {
        "id": "937",
        "name": "Υφαντής Πίτσα Rock N Roll 3Χ460γρ"
    },
    {
        "id": "938",
        "name": "Χρυσή Ζύμη Κρουασάν Βουτύρου 300γρ"
    },
    {
        "id": "939",
        "name": "Sanitas Αλουμινόχαρτο 30μ"
    },
    {
        "id": "941",
        "name": "Μπάρμπα Στάθης Μπάμιες Extra 450γρ"
    },
    {
        "id": "942",
        "name": "Παπαδημητρίου Balsamico Βιολογικό Καλαμάτας 250ml"
    },
    {
        "id": "943",
        "name": "Everyday Σερβ Super/Ultra Plus Sens 18τεμ"
    },
    {
        "id": "944",
        "name": "Babycare Μωροπ/τες Αντ/κο 3Χ72τεμ"
    },
    {
        "id": "945",
        "name": "Mythos Μπύρα 330ml"
    },
    {
        "id": "946",
        "name": "Νουνού Γάλα Συμπ Μερίδες Διχ 10Χ15γρ"
    },
    {
        "id": "947",
        "name": "Elvive Color Vive Μάσκα Μαλ 300ml"
    },
    {
        "id": "948",
        "name": "Garnier Express Ντεμακιγιάζ Ματιών 2σε1 125ml"
    },
    {
        "id": "949",
        "name": "Κύκνος Χυμ Τομάτας Συμπ 500γρ"
    },
    {
        "id": "950",
        "name": "Ferrero Rocher Πραλίνες 16τεμ 200γρ"
    },
    {
        "id": "951",
        "name": "Maggi Κύβοι Ζωμού Κότας 6λιτ 12τεμ"
    },
    {
        "id": "952",
        "name": "Όλυμπος Βούτυρο Αγελ Πακ 250γρ"
    },
    {
        "id": "953",
        "name": "Nivea Κρέμα Ξυρίσματος 100ml"
    },
    {
        "id": "954",
        "name": "Veet Ταινίες Κρύο Κερί 20τεμ"
    },
    {
        "id": "955",
        "name": "Γιώτης Ανθός Αραβοσίτου Βανίλια 43γρ"
    },
    {
        "id": "956",
        "name": "Maggi Μείγμα Λαχανικών Νοστιμιά Σε Σκόνη 130γρ"
    },
    {
        "id": "957",
        "name": "Sanitas Παγοκυψέλες 2 Σε 1"
    },
    {
        "id": "958",
        "name": "Purina Gold Gourmet Γατ/Φή Βοδ/Κοτ 85γρ"
    },
    {
        "id": "959",
        "name": "Ροδάκινα Εγχ"
    },
    {
        "id": "960",
        "name": "Sanitas Αντικολλητικό Χαρτί 8μετ"
    },
    {
        "id": "961",
        "name": "Ωμέγα Special Ρύζι Basmati 1κιλ"
    },
    {
        "id": "962",
        "name": "Akis Ρυζάλευρο 500γρ"
    },
    {
        "id": "963",
        "name": "Nan Optipro 4 Γάλα Σε Σκόνη Δεύτερης Βρεφικής Ηλικίας 400γρ"
    },
    {
        "id": "964",
        "name": "Syoss Σαμπ Όγκο 750ml"
    },
    {
        "id": "965",
        "name": "Neomat Total Eco Απορ Τριαν 14πλ 700γρ"
    },
    {
        "id": "966",
        "name": "Bacardi Ρούμι 700ml"
    },
    {
        "id": "967",
        "name": "Septona Σαμπουάν Και Αφρόλουτρο Βρεφικό Με Λεβαντα 500ml"
    },
    {
        "id": "968",
        "name": "Frulite Φρουτοπ Καροτ/Πορτ/Μαγκ 1λιτ"
    },
    {
        "id": "969",
        "name": "Όλυμπος Φυσικός Χυμός Πορτ 500ml"
    },
    {
        "id": "970",
        "name": "Kellogg’s Δημητριακά Corn Flakes 375γρ"
    },
    {
        "id": "971",
        "name": "Μακβελ Μακαρόνια Σπαγγέτι No 10 500γρ"
    },
    {
        "id": "972",
        "name": "Λακώνια Φυσ Χυμός Πορτοκάλι 250ml"
    },
    {
        "id": "973",
        "name": "Bic Ξυρ Μηχ Classic 10τεμ"
    },
    {
        "id": "974",
        "name": "Μεβγάλ Κρέμα Βανίλια 150γρ"
    },
    {
        "id": "975",
        "name": "Dettol Απολυμαντικό Για Ρούχα"
    },
    {
        "id": "976",
        "name": "Ariel Υγρό Απορρυπαντικό Ρούχων Alpine 28μεζ"
    },
    {
        "id": "977",
        "name": "Nan Optipro 2 Γάλα Σε Σκόνη Δεύτερης Βρεφικής Ηλικίας 800γρ"
    },
    {
        "id": "978",
        "name": "Ήπειρος Φέτα Ποπ Σε Άλμη 400γρ"
    },
    {
        "id": "979",
        "name": "ΣΟΥΡΩΤΗ Μεταλλικό Νερό Ανθρ Λεμον 330ml "
    },
    {
        "id": "980",
        "name": "Κλεοπάτρα Σαπούνι 125γρ"
    },
    {
        "id": "981",
        "name": "Μεβγάλ High Protein Choc Drink 242ml"
    },
    {
        "id": "982",
        "name": "Proderm Υγρό Απορ/κο 17μεζ 1250ml"
    },
    {
        "id": "983",
        "name": "Μηλοκλέφτης Μηλίτης 330ml"
    },
    {
        "id": "984",
        "name": "Pom Pon Μαντ Καθαρ Argan Oil 20τεμ"
    },
    {
        "id": "985",
        "name": "Αλλατίνη Φαρίνα Κέικ Φλάουρ 500γρ"
    },
    {
        "id": "986",
        "name": "Libero Swimpants Πάνες Midi 10-16κιλ 6τεμ"
    },
    {
        "id": "987",
        "name": "Nescafe Classic Στιγμιαίος Καφές 200γρ"
    },
    {
        "id": "988",
        "name": "Αλλατίνη Κέικ Βανίλια Με Κακάο 400γρ"
    },
    {
        "id": "989",
        "name": "Gillette Fusion Αντ/κα Ξυραφ 4τεμ"
    },
    {
        "id": "991",
        "name": "Όλυμπος Τυρί Χωριάτικο Σε Άλμη 400γρ"
    },
    {
        "id": "992",
        "name": "Neslac Επιδόρπιο Γάλακτος Μπισκότο 4Χ100γρ"
    },
    {
        "id": "993",
        "name": "Κρι Κρι Σπιτικό Επιδόρπιο Γιαουρτιού 5% 1κιλ"
    },
    {
        "id": "994",
        "name": "Pillsbury Ζύμη Φρέσκια Σφολιάτας 700γρ"
    },
    {
        "id": "995",
        "name": "Alpro Ρόφημα Αμύγδαλο Χ Γλουτ 1λιτ"
    },
    {
        "id": "996",
        "name": "Μεβγάλ Γάλα Αγελ Λευκό 3,5% Λιπ 2λιτ"
    },
    {
        "id": "997",
        "name": "Morfat Κρέμα Σαντιγύ Μετ 250γρ"
    },
    {
        "id": "998",
        "name": "Δωδώνη Γιαούρτι Στραγγιστό 2% 1Kg"
    },
    {
        "id": "999",
        "name": "Μεβγάλ Harmony Gourm ΑλατΚαραμ /Dark Choc 165γρ"
    },
    {
        "id": "1000",
        "name": "Χρυσά Αυγά Φρέσκα Αχυρώνα Medium 53-63γρ 6τεμ"
    },
    {
        "id": "1001",
        "name": "Νίκας Γαλοπούλα Καπνιστή Φέτες 160γρ"
    },
    {
        "id": "1002",
        "name": "Όλυμπος Γιαούρτι Στραγγιστό 2% Λιπ 1κιλ"
    },
    {
        "id": "1003",
        "name": "Nivea After Shave Balsam Sens 100ml"
    },
    {
        "id": "1004",
        "name": "Χυμός Ρόδι/Μηλ/Καρ Χριστοδούλου 1λιτ"
    },
    {
        "id": "1006",
        "name": "Maggi Barilla Spaghettoni No7 500γρ"
    },
    {
        "id": "1010",
        "name": "Παυλίδης Γκοφρέτα 3bit 31γρ"
    },
    {
        "id": "1011",
        "name": "Pampers Πάνες Μωρού Premium Pants Nο 5 12-17κιλ 34τεμ"
    },
    {
        "id": "1012",
        "name": "Νουνού Γάλα Εβαπορέ Light 170γρ"
    },
    {
        "id": "1013",
        "name": "Κοτόπουλα Νωπά Ολόκλ Τ.65% Μιμίκος  Π.Α.Ελλην Συσκ/Να"
    },
    {
        "id": "1015",
        "name": "Overlay Κρέμα Επίπλων 250ml"
    },
    {
        "id": "1016",
        "name": "Cutty Sark Ουίσκι 0,7λιτ"
    },
    {
        "id": "1017",
        "name": "Μινέρβα Χωριό Eλαιόλαδο Εξαιρ Παρθ 4λιτ"
    },
    {
        "id": "1018",
        "name": "Skip Σκόνη Regular 45πλ"
    },
    {
        "id": "1019",
        "name": "Cajoline Συμπυκνωμένο Μαλακτικό Blue Fresh 30μεζ"
    },
    {
        "id": "1020",
        "name": "Misko Ολικής Άλεσης Μακαρόνια Σπαγγέτι Ν6 500γρ"
    },
    {
        "id": "1021",
        "name": "Lenor Gold Orchid 56μεζ 1,4λιτ"
    },
    {
        "id": "1022",
        "name": "Proderm Kids Αφρόλουτρο Χαμομήλι 700ml"
    },
    {
        "id": "1023",
        "name": "Νουνού Γάλα Family Υψ Θερ Επ Light 1,5% 1,5λιτ"
    },
    {
        "id": "1024",
        "name": "Vileda Style Κουβάς"
    },
    {
        "id": "1025",
        "name": "Klinex Υγρό Απορρυπαντικό Ρούχων Fresh Clean 25μεζ"
    },
    {
        "id": "1026",
        "name": "Le Petit Marseillais Μάσκα Μαλλ Ξηρ 300ml"
    },
    {
        "id": "1028",
        "name": "Ajax Τζαμ Crystal Clean Αντ/Κο 750ml"
    },
    {
        "id": "1029",
        "name": "Babylino Πάνες Μωρού Sensitive Nο7 17+ κιλ 14τεμ"
    },
    {
        "id": "1030",
        "name": "Peppa Pig Φρουτοποτό Τροπ Φτούτα 250ml"
    },
    {
        "id": "1031",
        "name": "Cif Άσπρο Creαm 500ml"
    },
    {
        "id": "1032",
        "name": "Τσανός Μουστοκούλουρα 300γρ"
    },
    {
        "id": "1033",
        "name": "Παν Κρέμα Βαλσάμικο 250ml"
    },
    {
        "id": "1034",
        "name": "Ava Υγρό Πιάτων Action Λευκο Ξυδι Αντλια 650ml"
    },
    {
        "id": "1035",
        "name": "Διβάνη Βούτυρο Αγνό Γάλακτ Λιωμ 500γρ"
    },
    {
        "id": "1036",
        "name": "Vaseline Petroleum Jelly 100% Καθαρή Βαζελίνη 100 ml"
    },
    {
        "id": "1037",
        "name": "Παπαδοπούλου Τριμμα Φρυγανιας Τριμμα 180γρ"
    },
    {
        "id": "1038",
        "name": "Νίκας Σαλαμι Αέρος Συκευασμενο 100γρ"
    },
    {
        "id": "1039",
        "name": "Sensodyne Οδ/μα Complete Protection 75ml"
    },
    {
        "id": "1041",
        "name": "Στεργίου Μηλόπιτα Ατομική 105γρ"
    },
    {
        "id": "1042",
        "name": "Johnson Baby Βρεφικό Σαμπουάν Χαμομήλι Αντλιά 500ml"
    },
    {
        "id": "1043",
        "name": "7 Days Παξιμαδάκια Mini Κλασική Γεύση Bake Rolls 160γρ"
    },
    {
        "id": "1044",
        "name": "Παυλίδης Κουβερτούρα Κλασ 125γρ"
    },
    {
        "id": "1045",
        "name": "Becel Pro Activ Μαργαρίνη Σκαφ 250γρ"
    },
    {
        "id": "1046",
        "name": "Amstel Μπύρα 330ml"
    },
    {
        "id": "1047",
        "name": "Κιχί Πίτα Με Πράσο Ταψί Κατεψυγμένο 800γρ"
    },
    {
        "id": "1048",
        "name": "Φλώρινα Ξυνό Νερό 1λιτ"
    },
    {
        "id": "1049",
        "name": "Νουνού Τυρί Γκουντα Light 11% Φετ 175γρ"
    },
    {
        "id": "1050",
        "name": "Pescanova Μπακαλιάρος Φιλέτο 400γρ"
    },
    {
        "id": "1051",
        "name": "Vidal Αφρόλ White Musk 750ml"
    },
    {
        "id": "1052",
        "name": "Υφαντής Μπέικον Καπνιστό Χ Γλουτ 100γρ"
    },
    {
        "id": "1053",
        "name": "Πατάτες  Ελλ Κατ Β Ε/Ζ"
    },
    {
        "id": "1054",
        "name": "Μεβγάλ Only 2% Et Συρτ 3Χ200γρ"
    },
    {
        "id": "1055",
        "name": "Αύρα Φυσικό Μεταλλικό Νερό 500ml"
    },
    {
        "id": "1056",
        "name": "Παπαδοπούλου Αρτοσκεύασμα Πολύσπορο 540γρ"
    },
    {
        "id": "1057",
        "name": "Ντομάτες Εγχ Υπαιθρ Β "
    },
    {
        "id": "1058",
        "name": "Κρις Κρις Ψωμί Τοστ Σταρένιο 700gr"
    },
    {
        "id": "1059",
        "name": "Friskies Σκυλ/Φή Ξηρ Κοτ/Λαχ 1,5κιλ"
    },
    {
        "id": "1060",
        "name": "Quaker Τραγανές Μπουκ Σοκολ Υγείας 375γρ"
    },
    {
        "id": "1061",
        "name": "Όλυμπος Γάλα Ζωής Πλήρες Υψ Παστ 1,5λιτ"
    },
    {
        "id": "1062",
        "name": "Λαυράκια Υδατ  Καθαρ Ελλην400/600 Μεσογ Συσκ/Να"
    },
    {
        "id": "1063",
        "name": "Ντομάτες Εισ Α"
    },
    {
        "id": "1064",
        "name": "Γιώτης Κακάο 125γρ"
    },
    {
        "id": "1065",
        "name": "Agrino Φασόλια Γίγαντες Ελέφαντες Καστοριάς Π.Γ.Ε. 500γρ"
    },
    {
        "id": "1066",
        "name": "Αττική Μέλι 1κιλ"
    },
    {
        "id": "1067",
        "name": "Χωριό Ελαιόλαδο Κορωνεική Ποικ 1λιτ"
    },
    {
        "id": "1068",
        "name": "Νουνού Γάλα Σκόνη Frisolac 1ης Βρεφ Ηλικίας 800γρ"
    },
    {
        "id": "1069",
        "name": "Zewa Χαρ Υγείας Ultra Soft 8τεμ 912γρ"
    },
    {
        "id": "1070",
        "name": "Κατσίκια Νωπά Ελλην Γαλ Τεμ Χ/Κ Χ/Σ Ε/Ζ"
    },
    {
        "id": "1071",
        "name": "Roli Καθαριστικό Σκόνη Για Όλες Τις Επιφάνειες Λεμονί 500γρ"
    },
    {
        "id": "1072",
        "name": "Elite Φρυγανιές Σταριού Κουτί 250γρ"
    },
    {
        "id": "1073",
        "name": "Εν Ελλάδι Μπέικον Καπνιστό Σε Φέτες 100γρ"
    },
    {
        "id": "1074",
        "name": "Κεραμάρη Μάννα Αλεύρι Για Πίτες 1κιλ"
    },
    {
        "id": "1075",
        "name": "Στεργίου Κρουασάν Βιέννης Με Κρέμα Σοκολάτα 120γρ"
    },
    {
        "id": "1076",
        "name": "Ferrero Kinder Γάλακτοφέτες 5Χ140γρ"
    },
    {
        "id": "1077",
        "name": "Μέλισσα Μακαρόνια Σπαγγετίνη Νο 10 500γρ"
    },
    {
        "id": "1078",
        "name": "Στεργίου Τσουρέκι 380γρ"
    },
    {
        "id": "1080",
        "name": "Friskies Adult Ξηρά Γατ/Φή Βοδ/Συκ/Κοτ 400γρ"
    },
    {
        "id": "1082",
        "name": "3 Άλφα Φασόλια Μέτρια 500γρ"
    },
    {
        "id": "1083",
        "name": "Hansaplast Universal Αδιάβροχα 40τεμ"
    },
    {
        "id": "1084",
        "name": "Atrix Κρέμα Χερ Intens Χαμομήλι 150ml"
    },
    {
        "id": "1085",
        "name": "Bref Wc Power Active Αρωματικό Τουαλέτας Πεύκο 50γρ"
    },
    {
        "id": "1086",
        "name": "Nan Optipro Γάλα Τρίτης Βρεφικής Ηλικίας 400γρ"
    },
    {
        "id": "1087",
        "name": "Τσίπουρα Υδατ  Καθαρ Ελλην G 400/600 Μεσογ Συσκ/Νη"
    },
    {
        "id": "1089",
        "name": "Danone Activia Επιδ Γιαουρ Ακτιν 2Χ200γρ"
    },
    {
        "id": "1090",
        "name": "Pummaro Χυμός Τομάτα Πιο Συμπ/Νος 520γρ"
    },
    {
        "id": "1091",
        "name": "Κρεμμύδια Ξανθά Ξερά Εισ"
    },
    {
        "id": "1092",
        "name": "Κύκνος Τοματοχυμός 390ml"
    },
    {
        "id": "1093",
        "name": "Μεβγάλ Παραδ Γιαούρτι Αιγοπρ Ελαφ 2Χ220γρ"
    },
    {
        "id": "1094",
        "name": "Τσιλιλή Τσίπουρο Χ Γλυκάνισο 700ml"
    },
    {
        "id": "1095",
        "name": "Johnson's Baby Αφρόλουτρο Μπλε 750ml"
    },
    {
        "id": "1096",
        "name": "Λάπα Βόειου Α/Ο Νωπή Εισ"
    },
    {
        "id": "1097",
        "name": "Χρυσή Ζύμη Χωριάτικο Φυλλο Κατεψυγμένο 700γρ"
    },
    {
        "id": "1098",
        "name": "Μπάρμπα Στάθης Αρακάς 450γρ"
    },
    {
        "id": "1099",
        "name": "Nivea Visage Ημερ Kρ Απαλ Ενυδ Spf15 50ml"
    },
    {
        "id": "1100",
        "name": "OralB Οδ/Mα 1/2/3 75ml"
    },
    {
        "id": "1101",
        "name": "Becel Pro Activ Ρόφημα Γιαουρ Φράουλα 4Χ100γρ"
    },
    {
        "id": "1102",
        "name": "Kellogg's Δημητριακά Choco Pops Chocos 500γρ"
    },
    {
        "id": "1103",
        "name": "Παπαδοπούλου Φρυγανιές Χωριάτικες 240γρ"
    },
    {
        "id": "1104",
        "name": "Life Φρουτοποτό Πορτ/Μηλ/Καρ 400ml"
    },
    {
        "id": "1105",
        "name": "Pampers Πάνες Μωρού Premium Care Nο 6 13+κιλ 38τεμ"
    },
    {
        "id": "1106",
        "name": "Knorr Quick Soup Μανιτ Με Κρουτόν 36γρ"
    },
    {
        "id": "1107",
        "name": "Φάγε Total Γιαούρτι Στραγγιστό 2% 1κιλ"
    },
    {
        "id": "1108",
        "name": "Φάγε Μιγμ Tριμ 4 Τυρ 200γρ"
    },
    {
        "id": "1109",
        "name": "Στεργίου Κέικ Ανάμικτο 400γρ"
    },
    {
        "id": "1110",
        "name": "Λαιμός Χοιρινός Μ/Ο Νωπός Ελλ"
    },
    {
        "id": "1111",
        "name": "Κορπή Φυσικό Μεταλλικό Νερό 500ml"
    },
    {
        "id": "1112",
        "name": "Βιτάμ Μαργαρίνη Κλασικό 250γρ"
    },
    {
        "id": "1113",
        "name": "Everyday Σερβ/Κια Norm All Cotton 24τεμ"
    },
    {
        "id": "1114",
        "name": "Ρεπάνη Αγιωργίτικος Ερυθρός Οίνος 750ml"
    },
    {
        "id": "1115",
        "name": "Vanish Pink Πολυκαθαριστικό Λεκέδων 30γρ"
    },
    {
        "id": "1116",
        "name": "Κρίς Κρίς Τόστιμο Ψωμί Τόστ Σταρένιο 800γρ"
    },
    {
        "id": "1117",
        "name": "Όλυμπος Γάλα Κατσικίσιο Hπ 3,5% 1λιτ"
    },
    {
        "id": "1118",
        "name": "Νουνού Γάλα Family 3,6% 1λιτ"
    },
    {
        "id": "1119",
        "name": "Καλλιμάνης Χταπόδι Μικρό 595γρ"
    },
    {
        "id": "1120",
        "name": "Λουμίδης Καφές Ελληνικός 194γρ"
    },
    {
        "id": "1121",
        "name": "Sensodyne Οδ/μα Repair/Protect 75ml"
    },
    {
        "id": "1122",
        "name": "Ήρα Αλάτι Ψιλό 500γρ"
    },
    {
        "id": "1123",
        "name": "Trata Σαρδέλα Πικάντικη 100γρ"
    },
    {
        "id": "1124",
        "name": "Tide Alpine Απορ Χεριού Σκόνη 450γρ"
    },
    {
        "id": "1125",
        "name": "Dixan Υγρό Απορρυπαντικό Ρούχων Άνοιξης 30μεζ"
    },
    {
        "id": "1126",
        "name": "Κοτόπουλα Νωπά Ολόκλ Τ.65% Π.Α.Ελλην Συσκ/Να"
    },
    {
        "id": "1127",
        "name": "Άλτις Ελαιόλαδο Δοχείο 4λιτ"
    },
    {
        "id": "1128",
        "name": "La Vache Qui Rit Τυρί Φέτες Light 200γρ"
    },
    {
        "id": "1129",
        "name": "Johnson's 24η Κρ Ημ Essentials Hydr SPF15 50ml"
    },
    {
        "id": "1130",
        "name": "Cool Hellas Χυμός Πορτοκαλ Συμπ 1λιτ"
    },
    {
        "id": "1131",
        "name": "Pedigree Rodeo Σκυλ/Φή Μοσχ 70γρ"
    },
    {
        "id": "1132",
        "name": "Όλυμπος Γάλα Επιλεγμ. 3,7% Λ 1,5λιτ"
    },
    {
        "id": "1133",
        "name": "Αύρα Φυσικό Μεταλλικό Νερό 1.5λιτ"
    },
    {
        "id": "1134",
        "name": "Ίον Σοκοφρέτα Γάλακτ Με Φουντούκ 38γρ"
    },
    {
        "id": "1135",
        "name": "Στεργίου Κρουασάνάκια Με Γέμιση Πραλίνα 300γρ"
    },
    {
        "id": "1136",
        "name": "Κορπή Νερό 6Χ1,5λιτ"
    },
    {
        "id": "1137",
        "name": "Χρυσή Ζύμη Κασερόπιτα Σπιτική 850γρ"
    },
    {
        "id": "1139",
        "name": "Καρότα Εγχ "
    },
    {
        "id": "1140",
        "name": "Misko Μακαρόνια Για Παστίτσιο Ν2 500γρ"
    },
    {
        "id": "1141",
        "name": "Απαλαρίνα Λικέρ Μαστίχα 500ml"
    },
    {
        "id": "1143",
        "name": "Nan Optipro 1 Γάλα Σε Σκόνη Πρώτης Βρεφικής Ηλικίας 400γρ"
    },
    {
        "id": "1144",
        "name": "Πλωμάρι Ούζο 0,7λιτ"
    },
    {
        "id": "1145",
        "name": "Μεβγάλ Φέτα Vacuum 400γρ"
    },
    {
        "id": "1146",
        "name": "Καρπούζια Μίνι Εγχ"
    },
    {
        "id": "1147",
        "name": "Nescafe Classic Στιγμιαίος Καφές 50γρ"
    },
    {
        "id": "1149",
        "name": "Maggi Κύβοι Ζωμού Λαχανικών 6λιτ 12τεμ"
    },
    {
        "id": "1150",
        "name": "Sprite 6X330ml"
    },
    {
        "id": "1151",
        "name": "Alfa Κασερόπιτα Πηλίου Κατεψυγμένη 850γρ"
    },
    {
        "id": "1152",
        "name": "Whiskas Γατ/Φή Κοτόπουλο 400γρ"
    },
    {
        "id": "1155",
        "name": "Μεβγάλ Harmony 1% Με Μέλι/Γκραν 164γρ"
    },
    {
        "id": "1156",
        "name": "Φάγε Τρικαλινό Τυρί Ζαρί Light Φάγε 380γρ"
    },
    {
        "id": "1157",
        "name": "Pantene Κρέμα Μαλλ Αναδόμησης 270ml"
    },
    {
        "id": "1158",
        "name": "Σπάλα Βόειου/Ο Νωπή Εισ"
    },
    {
        "id": "1159",
        "name": "Μήλα Στάρκιν Χύμα"
    },
    {
        "id": "1160",
        "name": "Πέρκα Φιλέτο Κτψ Εισ Ε/Ζ "
    },
    {
        "id": "1161",
        "name": "Nan Optipro Γάλα Τρίτης Βρεφικής Ηλικίας 800γρ"
    },
    {
        "id": "1162",
        "name": "Υφαντής Hot Dog Nuggets Κοτόπουλου 500γρ"
    },
    {
        "id": "1163",
        "name": "Εν Ελλάδι Γαλοπούλα Καπνιστή Φέτες 160γρ"
    },
    {
        "id": "1164",
        "name": "Μύλοι Αγίου Γεωργίου Αλεύρι Για Όλες Τις Χρ 1κιλ"
    },
    {
        "id": "1165",
        "name": "Γιώτης Αλεύρι Φαρίνα Ολικής Άλεσης 500γρ"
    },
    {
        "id": "1166",
        "name": "Lipton Χαμομήλι Φακ 10τεμΧ1γρ"
    },
    {
        "id": "1168",
        "name": "Χρυσή Ζύμη Τυροπίτα Σπιτική 850γρ"
    },
    {
        "id": "1169",
        "name": "Dettol Κρεμ Sensitive Αντ/κο 750ml"
    },
    {
        "id": "1170",
        "name": "Dettol Κρεμοσάπουνο 250ml"
    },
    {
        "id": "1171",
        "name": "Κανάκι Φύλλο Κρούστας Νωπό 450γρ"
    },
    {
        "id": "1172",
        "name": "Κατσέλης Κριτσίνια Μακεδονικά Ολικής Άλεσης 200γρ"
    },
    {
        "id": "1173",
        "name": "Libresse Σερβιέτες Ultra Thin Long Wings 8τεμ"
    },
    {
        "id": "1174",
        "name": "Pampers Πάνες Βρακάκι Νο 5 11-18κιλ 15τεμ"
    },
    {
        "id": "1175",
        "name": "Septona Σαμπουάν Και Αφρόλουτρο Βρεφικό Με Αλοη 500ml"
    },
    {
        "id": "1176",
        "name": "Fissan Baby Bagnetto Υποαλ Σαμπουάν/Αφρόλ 500ml"
    },
    {
        "id": "1178",
        "name": "Danone Activia Επιδ Γιαουρ Καρυδ/Βρώμη 2Χ200γρ"
    },
    {
        "id": "1179",
        "name": "Noxzema Αφρόλ Talc 750ml"
    },
    {
        "id": "1180",
        "name": "Tasty Φουντούνια 105γρ"
    },
    {
        "id": "1181",
        "name": "Almiron-3 Γάλα Σε Σκόνη Τρίτης Βρεφικής Ηλικίας 800γρ"
    },
    {
        "id": "1182",
        "name": "Παυλίδης Σοκολάτα Υγείας Ν11 100γρ"
    },
    {
        "id": "1183",
        "name": "Μίνι Ούζο Επομ 700ml"
    },
    {
        "id": "1184",
        "name": "Nivea Μάσκα Peel Off 10ml"
    },
    {
        "id": "1185",
        "name": "Γιώτης Μείγμα Για Κρέπες 300γρ"
    },
    {
        "id": "1186",
        "name": "Dettol Αντιβ Υγρό Κρεμοσ Ευαίσθ Επιδερμ Αντ/κο 250ml"
    },
    {
        "id": "1187",
        "name": "Zewa Deluxe Χαρτί Υγείας 3 Φύλλα 8τεμ"
    },
    {
        "id": "1189",
        "name": "Nescafe Dolce Gusto Espresso Int Καψ 16x7γρ"
    },
    {
        "id": "1190",
        "name": "Ροδόπη Γιαούρτι Πρόβειο Βιο 240γρ"
    },
    {
        "id": "1191",
        "name": "Green Cola 1,5λιτ"
    },
    {
        "id": "1192",
        "name": "3 Άλφα Ρύζι Νυχάκι Ελληνικό 500γρ"
    },
    {
        "id": "1193",
        "name": "Μινέρβα Χωριό Μαργαρίνη Με Ελαιόλαδο 250γρ"
    },
    {
        "id": "1194",
        "name": "Pom Pon Μαντηλ Ντεμακ Sensit 20τεμ"
    },
    {
        "id": "1195",
        "name": "Orzene Σαμπουάν Μπύρας Κανον 400ml"
    },
    {
        "id": "1196",
        "name": "Μήλα Στάρκιν Ψιλά Συσκ/Να "
    },
    {
        "id": "1197",
        "name": "Νίκας Ωμοπλάτη Χωρίς Γλουτένη 160γρ"
    },
    {
        "id": "1198",
        "name": "Κρι Κρι Σπιτικό Επιδόρπιο Γιαουρτιού 2% 1κιλ"
    },
    {
        "id": "1199",
        "name": "Dettol Υγρό Πολυκαθαριστικό Αντιβακτηριδιακό 500ml Sparkling Lemon & Lime Burst Power & Fresh"
    },
    {
        "id": "1200",
        "name": "Μεβγάλ Αριάνι 1,5% Χ Γλουτ 500ml"
    },
    {
        "id": "1201",
        "name": "Fairy Original All in One Καψ Πλυντ Πιάτ Λεμόνι 22τεμ"
    },
    {
        "id": "1202",
        "name": "Βεργίνα Μπύρα 500ml"
    },
    {
        "id": "1203",
        "name": "Υφαντής Ferano Προσούτο Χ Γλουτ 80γρ"
    },
    {
        "id": "1204",
        "name": "Zest Familia Λουκανικοπιτάκια 800γρ"
    },
    {
        "id": "1205",
        "name": "Wella Flex Mousse Curles/Waves 200ml"
    },
    {
        "id": "1206",
        "name": "Corona Μπύρα Extra 355ml"
    },
    {
        "id": "1207",
        "name": "Αττική Μέλι 250γρ"
    },
    {
        "id": "1209",
        "name": "Always Σερβ Night 9τεμ"
    },
    {
        "id": "1210",
        "name": "Creta Farm Λουκάνικα Τρικάλων Με Πράσο 400γρ"
    },
    {
        "id": "1211",
        "name": "Γιώτης Αλεύρι Φαρίνα Πορτοκαλί 500γρ"
    },
    {
        "id": "1212",
        "name": "Στάμου Γιαούρτι Πρόβειο Παραδ 240γρ"
    },
    {
        "id": "1213",
        "name": "Μεβγάλ Topino Απαχο Γάλα Κακάο 310ml"
    },
    {
        "id": "1214",
        "name": "Γιώτης Ρυζόγαλο Στιγμής 105γρ"
    },
    {
        "id": "1215",
        "name": "Lipton Τσάι Ρόφημα 10 Φακ 1,5γρ"
    },
    {
        "id": "1216",
        "name": "Βλάχας Γάλα Εβαπορέ Πλήρες 410γρ"
    },
    {
        "id": "1218",
        "name": "Πέρκα Φιλέτο Κτψ Εισ Συσκ/Νη"
    },
    {
        "id": "1219",
        "name": "Μέλισσα Κριθαράκι Χονδρό 500γρ"
    },
    {
        "id": "1220",
        "name": "Serkova Βότκα 37,5% 0,7λιτ"
    },
    {
        "id": "1221",
        "name": "Quanto Μαλακτικό Ρούχων Ελληνικά Νησιά 18μεζ"
    },
    {
        "id": "1222",
        "name": "Μέλισσα Σπαγγέτι Ολικής Άλεσης 500γρ"
    },
    {
        "id": "1223",
        "name": "Δέλτα Ρόφημα Advance Υψ Παστ Μπουκ 1λιτ"
    },
    {
        "id": "1224",
        "name": "Fouantre Γαλοπούλα Σε Φέτες 120γρ"
    },
    {
        "id": "1225",
        "name": "Pillsbury Αφρατ Ζυμ Για Πίτσα 400γρ"
    },
    {
        "id": "1226",
        "name": "Τοπ Ξύδι Κοκκίνου Κρασιού 350ml"
    },
    {
        "id": "1227",
        "name": "Δέλτα Advance Επιδ Αλεσμένα Δημητρ 2Χ150γρ"
    },
    {
        "id": "1228",
        "name": "Ariel Υγρές Καψ 3σε1 Κανονικό 24πλ"
    },
    {
        "id": "1229",
        "name": "Quaker Νιφ Βρώμης Ολ Άλεσης Μεταλ 500γρ"
    },
    {
        "id": "1230",
        "name": "Ντομάτες Εγχ Υπαιθρ Α "
    },
    {
        "id": "1231",
        "name": "Ready2U Μάσκες Προστ Προσώπου 50τεμ"
    },
    {
        "id": "1232",
        "name": "Soupline Συμπυκνωμένο Μαλακτικό Ρούχων Λεβάντα 28μεζ"
    },
    {
        "id": "1233",
        "name": "Μεβγάλ Harmony Gourmet Πορτοκ Νιφ Σοκ 165γρ"
    },
    {
        "id": "1234",
        "name": "Μινέρβα Χωριό Φέτα Ποπ Βιολ Άλμη 350γρ"
    },
    {
        "id": "1235",
        "name": "Gillette Fusion Proglide Power Ανταλ 3 τεμ"
    },
    {
        "id": "1236",
        "name": "Iglo Fish Sticks 300γρ"
    },
    {
        "id": "1237",
        "name": "Fix Hellas Mπύρα 330ml"
    },
    {
        "id": "1238",
        "name": "Νουνού Γάλα Family 3,6% 1,5λιτ"
    },
    {
        "id": "1239",
        "name": "Colgate Οδ/Μα Total Original 75ml"
    },
    {
        "id": "1240",
        "name": "Ajax Υγρό Γενικού Καθαρισμού Kloron Lila 1λιτ"
    },
    {
        "id": "1241",
        "name": "Calliga Demi Sec Ροζέ Οίνος 750ml"
    },
    {
        "id": "1242",
        "name": "Μεβγάλ Στραγγιστό Γιαούρτι 2% 3Χ200γρ"
    },
    {
        "id": "1243",
        "name": "Scotch Brite Σφουγγ Κουζ Γίγας Αντιβ"
    },
    {
        "id": "1244",
        "name": "Ίον Σοκολάτα Αμυγδάλου 70γρ"
    },
    {
        "id": "1245",
        "name": "Παπαδοπούλου Krispies Ολικής Χωρίς Ζάχαρη 200γρ"
    },
    {
        "id": "1246",
        "name": "Μπάρμπα Στάθης Αρακάς Λαδερός 1κιλ"
    },
    {
        "id": "1247",
        "name": "7 Days Swiss Roll Κακάο 200γρ"
    },
    {
        "id": "1249",
        "name": "Όλυμπος Γάλα Επιλεγμ 1,5% Λ 1,5λιτ"
    },
    {
        "id": "1250",
        "name": "Μεβγάλ Γάλα Αγελ Λευκό Light 1,5% 500ml"
    },
    {
        "id": "1251",
        "name": "Amita Φυσικός Χυμός Πορτοκάλι 100% 1λιτ"
    },
    {
        "id": "1253",
        "name": "Amstel Μπύρα Premium Quality 0,5λιτ"
    },
    {
        "id": "1254",
        "name": "Fytro Ζάχαρη Καστανή Ακατέργαστη 500γρ"
    },
    {
        "id": "1255",
        "name": "Ίον Σοκολάτα Γάλακτος Αμυγδάλου 100γρ"
    },
    {
        "id": "1256",
        "name": "L'Oreal Κρέμα Προσ Καν/Μικτ Επιδ 3 Φρον 50ml"
    },
    {
        "id": "1257",
        "name": "Neslac Επιδόρπιο Γάλακτος Βανίλια 4Χ100γρ"
    },
    {
        "id": "1258",
        "name": "Κρεμμύδια Ξανθά Ξερά Εγχ"
    },
    {
        "id": "1260",
        "name": "Μεβγάλ Γάλα «Κάθε Μέρα» 1.5% 1λιτ"
    },
    {
        "id": "1261",
        "name": "Barilla Σάλτσα Βασιλικος 400γρ"
    },
    {
        "id": "1262",
        "name": "Haribo Goldbaren Καραμ Ζελίνια Αρκουδ 100γρ"
    },
    {
        "id": "1263",
        "name": "Δέλτα Γάλα Πλήρες 1λιτ"
    },
    {
        "id": "1264",
        "name": "Almiron-2 Γάλα Σε Σκόνη Δεύτερης Βρεφικής Ηλικίας 800γρ"
    },
    {
        "id": "1265",
        "name": "Καραμολέγκος Παξαμάς Κρίθινος 600γρ"
    },
    {
        "id": "1266",
        "name": "Swiffer Πανάκια Αντ/Κα 16τεμ"
    },
    {
        "id": "1267",
        "name": "Stella Artois Μπύρα 6x330ml"
    },
    {
        "id": "1268",
        "name": "Pampers Premium Care No 5 11-18κιλ 44τεμ"
    },
    {
        "id": "1269",
        "name": "Campari Bitter Aπεριτίφ 700ml"
    },
    {
        "id": "1271",
        "name": "Lurpak Soft Μειωμέν Λιπαρ Ανάλ 225γρ"
    },
    {
        "id": "1272",
        "name": "Rol Σκόνη Για Πλυσ Στο Χέρι 380γρ"
    },
    {
        "id": "1273",
        "name": "Johnson Baby Βρεφικό Σαμπουάν Αντλιά 500ml"
    },
    {
        "id": "1274",
        "name": "Μινέρβα Χωριό Ορεινές Περιοχές Ελαιόλαδο Παρθένο 2λιτ"
    },
    {
        "id": "1276",
        "name": "Always Σερβ Ultra Platinum Night 12τεμ"
    },
    {
        "id": "1277",
        "name": "Dettol Κρεμ Relax Αντ/κο 750ml"
    },
    {
        "id": "1278",
        "name": "Υφαντής Κεφτεδάκια Κτψ 500γρ"
    },
    {
        "id": "1279",
        "name": "Τοπ Κρέμα Βαλσάμικο Με Λεμόνι & Μέλι 200ml"
    },
    {
        "id": "1280",
        "name": "Chicco Βρέφική Κρέμα Συγκάματος 100ml"
    },
    {
        "id": "1281",
        "name": "Pampers Πάνες Premium Care Nο 3 5-9 κιλ 60τεμ"
    },
    {
        "id": "1282",
        "name": "Σολομός Νωπός Φιλετ/νος Με Δέρμα Υδ Νορβ/Εισαγ  Β.Α Ατλ Συσκ/νος"
    },
    {
        "id": "1283",
        "name": "Εύρηκα Bright Ενισχυτικό Πλύσης Πολυκαθαριστικό Λεκέδων 500g"
    },
    {
        "id": "1285",
        "name": "Παπαδημητρίου Κρέμα Balsamico Με Ρόδι Με Στέβια 250ml"
    },
    {
        "id": "1286",
        "name": "Άλτις Παραδοσιακό Ελαιόλαδο Παρθένο 1λιτ"
    },
    {
        "id": "1287",
        "name": "Κύκνος Τοματάκι Ψιλοκ Χαρτ Συσκ 370γρ"
    },
    {
        "id": "1288",
        "name": "Τσίχλες Trident Δυόσμος 8γρ"
    },
    {
        "id": "1289",
        "name": "Wella Flex Mousse Ultra Strong 200ml"
    },
    {
        "id": "1290",
        "name": "Nivea Black/White Invisible 48h Rollon 50ml"
    },
    {
        "id": "1291",
        "name": "Axe Αποσμ Σπρέυ Dark Temptation 150ml"
    },
    {
        "id": "1292",
        "name": "Kerrygold Τυρί Regato 270γρ"
    },
    {
        "id": "1293",
        "name": "Gillette Ξυρ Μηχ Mach 3 Turbo+Ανταλ"
    },
    {
        "id": "1294",
        "name": "Ίον Σοκολάτα Γάλακτος 100γρ"
    },
    {
        "id": "1295",
        "name": "Μεβγάλ Στραγγιστό Γιαούρτι 2% 1κιλ"
    },
    {
        "id": "1296",
        "name": "Gelita Ζελατίνη Φύλλα 20γρ"
    },
    {
        "id": "1297",
        "name": "Κρίς Κρίς Ψωμί Τόστ Μπρίος 400γρ"
    },
    {
        "id": "1298",
        "name": "Κύκνος Κέτσαπ Χ Γλουτ 330γρ"
    },
    {
        "id": "1299",
        "name": "Misko Μακαρόνια Σπαγγέτι Ν5 500γρ"
    },
    {
        "id": "1300",
        "name": "Μεβγάλ Πολίτικο 2Χ150γρ"
    },
    {
        "id": "1301",
        "name": "Nivea Γαλάκτ Καθαρ Ξηρ/ Ευαίσθ Επιδ 200ml"
    },
    {
        "id": "1302",
        "name": "Ζωγράφος Μακαρόνια Διαίτης Ν6 500γρ"
    },
    {
        "id": "1303",
        "name": "Καραμολέγκος Πίτες Για Σουβλ Σταρεν 10τεμ 820γρ"
    },
    {
        "id": "1304",
        "name": "Pampers Active Baby No4+ 10-15κιλ 16τεμ"
    },
    {
        "id": "1305",
        "name": "Ajax Άσπρος Σίφουνας Λεμόνι 1000ml"
    },
    {
        "id": "1306",
        "name": "Κύκνος Τομάτες Αποφλ Ολoκλ 400γρ"
    },
    {
        "id": "1307",
        "name": "Κιλότο Βόειου Α/Ο Νωπό Ελλ Εκτρ Άνω Των 5 Μην"
    },
    {
        "id": "1308",
        "name": "Ajax Τζαμιών 450ml"
    },
    {
        "id": "1309",
        "name": "Kellogg's Special K Μπάρα Δημητριακών Με Ξηρούς Καρπούς Καρύδα Και Κασioυς 4Χ28γρ"
    },
    {
        "id": "1310",
        "name": "Βέρμιον Νάουσα Κομπόστα Ροδάκινο 1κιλ"
    },
    {
        "id": "1311",
        "name": "Chipita Frau Lisa Bάση Τούρτας Κακάο 400γρ"
    },
    {
        "id": "1312",
        "name": "Amita Motion Φυσικός Χυμός 330ml"
    },
    {
        "id": "1313",
        "name": "Heineken Μπύρα 330ml"
    },
    {
        "id": "1314",
        "name": "Creta Farms Εν Ελλάδι Κοτομπουκιές Κτψ 400γρ"
    },
    {
        "id": "1315",
        "name": "Δέλτα Milko Κακάο 500ml"
    },
    {
        "id": "1316",
        "name": "Alfa Μπουγάτσα Θες/νίκης Κρέμα 800γρ"
    },
    {
        "id": "1317",
        "name": "Leerdammer Τόστ Light 10 φέτες 175γρ"
    },
    {
        "id": "1318",
        "name": "Μεβγάλ Τριμμένο Τυρί Light 10% Λ 200γρ"
    },
    {
        "id": "1319",
        "name": "Ζωγράφος Καστανή Ζάχαρη 500γρ"
    },
    {
        "id": "1320",
        "name": "Κορπή Νερό 6χ0,5ml"
    },
    {
        "id": "1321",
        "name": "Παπαδημητρίου Balsamico Με Μέλι 250ml"
    },
    {
        "id": "1322",
        "name": "Sol Ηλιέλαιο 1λιτ"
    },
    {
        "id": "1323",
        "name": "Pummaro Ψιλοκ Τοματ Κλασ 400γρ"
    },
    {
        "id": "1324",
        "name": "Nivea After Shave Balsam 100ml"
    },
    {
        "id": "1325",
        "name": "Pantene Σαμπουάν Αναδόμησης 360ml"
    },
    {
        "id": "1326",
        "name": "Δέλτα Γάλα 2λιτ"
    },
    {
        "id": "1327",
        "name": "Μπάρπα Στάθης Τομάτα Στον Τρίφτη 500γρ"
    },
    {
        "id": "1328",
        "name": "Υφαντής Γαλοπούλα Βραστή 160γρ"
    },
    {
        "id": "1329",
        "name": "L'Oreal Excellence Βαφή Μαλ Ξανθό Ν7"
    },
    {
        "id": "1332",
        "name": "Μεβγάλ Only 0% Et Συρτ 3Χ200γρ"
    },
    {
        "id": "1333",
        "name": "Παπαδοπούλου Krispies Σουσάμι 200γρ"
    },
    {
        "id": "1334",
        "name": "Πορτοκ Μερλίν - Λανε Λειτ- Ναβελ Λειτ Εγχ Χυμ Συσκ/Να"
    },
    {
        "id": "1335",
        "name": "Μεβγάλ Γιαούρτι Πρόβειο Παραδ 300γρ"
    },
    {
        "id": "1336",
        "name": "Tuborg Σόδα 330ml"
    },
    {
        "id": "1337",
        "name": "Νέα Φυτίνη Φυτικό Μαγειρικό Λίπος 400γρ"
    },
    {
        "id": "1338",
        "name": "Φάγε Total Γιαούρτι 5% 200γρ"
    },
    {
        "id": "1339",
        "name": "Botanic Therapy Σαμπουάν Επανόρθ 400ml"
    },
    {
        "id": "1340",
        "name": "Γιώτης Κουβερτούρα Σε Σταγόνες 100γρ"
    },
    {
        "id": "1341",
        "name": "Cheetos Pacotinia 114γρ"
    },
    {
        "id": "1342",
        "name": "Ίον Σοκολάτα Γάλακτος 45γρ"
    },
    {
        "id": "1343",
        "name": "Παπαδοπούλου Ψωμί Σίτου Φυσ Προζύμι 700γρ"
    },
    {
        "id": "1344",
        "name": "Whiskas Γατ/Φή Πουλ Σε Σάλτσα 100γρ"
    },
    {
        "id": "1345",
        "name": "3 Άλφα Φακές Ψιλές Εισαγωγής 500γρ"
    },
    {
        "id": "1346",
        "name": "7 Days Bake Rolls Pizza 160γρ"
    },
    {
        "id": "1347",
        "name": "Σαρδέλλες Νωπές Καθαρ Απεντ/νες Ελλην Μεσογ Συσκ/Νες"
    },
    {
        "id": "1349",
        "name": "Νουνού Γάλα Εβαπορέ Light 400γρ"
    },
    {
        "id": "1350",
        "name": "Μιμίκος Κοτόπουλο Φιλ Μπούτ Νωπό Τυποπ 650γρ"
    },
    {
        "id": "1351",
        "name": "Χρυσή Ζύμη Χορτοπίτα Σπιτική 850γρ"
    },
    {
        "id": "1352",
        "name": "Ζαγόρι Νερό 500ml"
    },
    {
        "id": "1353",
        "name": "Palmolive Υγρό Πιάτων Regular 500ml"
    }
]
    '''

    product_data = json.loads(json_data)
    save_product_images(product_data)

if __name__ == "__main__":
    main()
